{
  "Type": 100,
  "Message": "News from last 1 hour(s)",
  "Data": [
    {
      "id": "53462728",
      "guid": "https://timestabloid.com/?p=87140",
      "published_on": 1761066320,
      "imageurl": "https://resources.cryptocompare.com/news/67/default.png",
      "title": "Time Traveler to XRP Holders: You Are Richer Than 70% of the Rich in the USA Right Now",
      "url": "https://timestabloid.com/time-traveler-to-xrp-holders-you-are-richer-than-70-of-the-rich-in-the-usa-right-now/",
      "body": "A provocative claim is stirring intense debate across the crypto community. According to a post by Time Traveler on X, those holding XRP today are “richer than 70% of the rich in the USA.” The statement immediately caught attention—not just for its audacity, but for what it implies about how the digital economy is redefining wealth itself. Beneath the headline lies an eye-opening comparison between the value of XRP holdings and the net worth of America’s upper class, a comparison that, surprisingly, isn’t as far-fetched as it sounds. The Viral Statement That Sparked Conversation Time Traveler’s post struck a chord because it challenges the traditional metrics of affluence. For decades, wealth in America has been measured in dollars, assets, and ownership stakes. But Time Traveler’s comment reframes that narrative, suggesting that crypto holdings, particularly XRP, can propel ordinary investors into wealth brackets once reserved for the elite. His remark is not merely speculative hype; it’s a reflection of the shifting landscape where digital assets increasingly rival traditional stores of value. If you hold XRP, you are richer than 70% of the rich in the USA right now. — 𝚃𝚒𝚖𝚎 𝚃𝚛𝚊𝚟𝚎𝚕𝚎𝚛 (@Traveler2236) October 20, 2025 Defining “The Rich” in the United States To understand the scale of Time Traveler’s assertion, it’s essential to define what “the rich” actually means. According to recent data from the Federal Reserve’s 2023 Distributional Financial Accounts, the top 10% of U.S. households by net worth begin at around $1.6 million. Within that group, the 95th percentile—roughly the midpoint of the top 10%—has an estimated net worth of $3.8 million, while households at the 97th percentile typically possess between $4 million and $6 million. So, when Time Traveler says XRP holders are richer than 70% of the rich, the implication is that some of these holders have net worth exceeding that of about 97% of the American population. It’s a striking statement that demands a closer look at XRP’s market value and what kind of holdings could justify such a comparison. The Current Value of XRP and Its Implications As of report time, XRP trades at approximately $2.42, maintaining its position among the top-ranked digital assets by market capitalization. This valuation forms the basis for the wealth comparison. If one were to hold around 1.6 to 2 million XRP, that would translate to a dollar value between $3.8 million and $5 million, a range that places the holder within the upper few percentiles of U.S. wealth distribution. We are on X, follow us to connect with us :- @TimesTabloid1 — TimesTabloid (@TimesTabloid1) June 15, 2025 In practical terms, this means that early XRP investors, particularly those who accumulated during its early years when the token traded for mere cents, could now find themselves sitting on portfolios that rival those of established millionaires. Time Traveler’s post, therefore, is not an exaggeration but a mathematical observation grounded in current economic realities. The Bigger Picture: Wealth, Volatility, and Digital Transformation While Time Traveler’s claim holds for certain holders, it doesn’t imply that every XRP investor shares that level of affluence. Cryptocurrency remains a volatile asset class, and wealth measured in tokens can fluctuate dramatically within hours. However, the underlying message of the post is deeply significant. It highlights how blockchain technology and early digital adoption are dismantling traditional barriers to wealth creation. In a financial world once dominated by legacy systems, crypto assets like XRP are creating parallel pathways to prosperity . A Redefinition of Wealth Time Traveler’s viral statement may sound sensational, but it speaks to a broader transformation underway in global finance. For a select group of XRP holders, the math genuinely checks out; they stand wealthier than much of America’s elite. More importantly, the post encapsulates the essence of the crypto revolution: wealth is no longer determined solely by access to traditional financial instruments but by foresight, timing, and belief in technological change. In a world where code increasingly competes with capital, Time Traveler’s message is both a revelation and a reminder that the future of wealth might already be here, and it’s digital. Disclaimer : This content is meant to inform and should not be considered financial advice. The views expressed in this article may include the author’s personal opinions and do not represent Times Tabloid’s opinion. Readers are urged to do in-depth research before making any investment decisions. Any action taken by the reader is strictly at their own risk. Times Tabloid is not responsible for any financial losses. Follow us on Twitter , Facebook , Telegram , and Google News The post Time Traveler to XRP Holders: You Are Richer Than 70% of the Rich in the USA Right Now appeared first on Times Tabloid .",
      "tags": "Cryptocurrency|News|XRP|XRP Holders|XRP Price",
      "lang": "EN",
      "upvotes": "0",
      "downvotes": "0",
      "categories": "BUSINESS|MARKET|XRP|MACROECONOMICS|CRYPTOCURRENCY",
      "source_info": {
        "name": "TimesTabloid",
        "img": "https://resources.cryptocompare.com/news/67/default.png",
        "lang": "EN"
      },
      "source": "timestabloid"
    },
    {
      "id": "53462734",
      "guid": "https://en.coinotag.com/bitcoin-gains-on-gold-amid-sharp-precious-metal-sell-off/",
      "published_on": 1761066318,
      "imageurl": "https://resources.cryptocompare.com/news/77/53462734.jpeg",
      "title": "Bitcoin Gains on Gold Amid Sharp Precious Metal Sell-Off",
      "url": "https://en.coinotag.com/bitcoin-gains-on-gold-amid-sharp-precious-metal-sell-off/",
      "body": "Bitcoin is outperforming gold with a nearly 9% gain against the traditional safe-haven asset as of recent trading, marking its largest advance since April and signaling shifting investor preferences in",
      "tags": "Bitcoin|News|BTC",
      "lang": "EN",
      "upvotes": "0",
      "downvotes": "0",
      "categories": "BTC|BUSINESS|FIAT|TRADING|CRYPTOCURRENCY",
      "source_info": {
        "name": "CoinOtag",
        "img": "https://resources.cryptocompare.com/news/77/default.png",
        "lang": "EN"
      },
      "source": "coinotag"
    },
    {
      "id": "53462733",
      "guid": "https://en.bitcoinsistemi.com/october-ended-up-empty-bitcoin-still-cant-find-its-direction-analyst-these-levels-are-very-critical-they-must-be-monitored-closely/",
      "published_on": 1761066309,
      "imageurl": "https://resources.cryptocompare.com/news/81/53462733.jpeg",
      "title": "October Ended Up Empty, Bitcoin Still Can't Find Its Direction! Analyst: \"These Levels Are Very Critical, They Must Be Monitored Closely!\"",
      "url": "https://en.bitcoinsistemi.com/october-ended-up-empty-bitcoin-still-cant-find-its-direction-analyst-these-levels-are-very-critical-they-must-be-monitored-closely/",
      "body": "Leading cryptocurrency Bitcoin (BTC) experienced sharp declines in October, known as the historically bullish month. At this point, although Bitcoin has risen today, it has continued to decline despite its traditional upward trend in October and is still looking for direction. Analyst James Van Straten said that Bitcoin continued to struggle in October, which is known as one of the strongest months in history. The analyst noted that Bitcoin is moving sideways between its 200-day and 365-day simple moving averages (SMA), adding that the $103,000 support level is critical. Stating that the 200-day SMA has mostly served as support for Bitcoin since the 2023 cycle began, the analyst stated that when this level cannot be held, the 365-day SMA acts as secondary support. Stating that the 365-day SMA is located at $100,367, the analyst said that Bitcoin is stuck between the 200 and 365-day SMAs. “While investors generally expect a price increase in October, market sentiment has so far failed to meet those hopes. BTC consolidated between the 200-day SMA of $107,846 and the 365-day SMA of $100,367. This is the fourth time this cycle that Bitcoin price has been stuck between these two averages, and this sideways trend could last for months. The analyst also noted that the 200-day SMA is often used as a dividing line between bull and bear markets, saying, “Breaking above the 200-day SMA is the key to a short-term recovery and trend reversal. However, if it fails to break above this line, a prolonged sideways movement is likely to continue.” The analyst recently noted that key levels to watch for Bitcoin include $103,509 (2025 investor cost basis), $100,000 (psychological basis), and $112,100 (short-term cost basis). *This is not investment advice. Continue Reading: October Ended Up Empty, Bitcoin Still Can't Find Its Direction! Analyst: \"These Levels Are Very Critical, They Must Be Monitored Closely!\"",
      "tags": "Analysis|Bitcoin|News",
      "lang": "EN",
      "upvotes": "0",
      "downvotes": "0",
      "categories": "BTC|BUSINESS|MARKET|TRADING|CRYPTOCURRENCY",
      "source_info": {
        "name": "BitcoinSistemi",
        "img": "https://resources.cryptocompare.com/news/81/default.png",
        "lang": "EN"
      },
      "source": "bitcoinsistemi"
    },
    {
      "id": "53462691",
      "guid": "https://en.bitcoinsistemi.com/breaking-coinbase-futures-decides-to-delist-two-altcoins/",
      "published_on": 1761066246,
      "imageurl": "https://resources.cryptocompare.com/news/81/53462691.jpeg",
      "title": "BREAKING: Coinbase Futures Decides to Delist Two Altcoins",
      "url": "https://en.bitcoinsistemi.com/breaking-coinbase-futures-decides-to-delist-two-altcoins/",
      "body": "The futures arm of cryptocurrency exchange Coinbase is delisting Freysa (FAI) and Moonwell (WELL) tokens. *This is not investment advice. Continue Reading: BREAKING: Coinbase Futures Decides to Delist Two Altcoins",
      "tags": "Altcoin|News",
      "lang": "EN",
      "upvotes": "0",
      "downvotes": "0",
      "categories": "ALTCOIN|EXCHANGE|CRYPTOCURRENCY",
      "source_info": {
        "name": "BitcoinSistemi",
        "img": "https://resources.cryptocompare.com/news/81/default.png",
        "lang": "EN"
      },
      "source": "bitcoinsistemi"
    },
    {
      "id": "53462690",
      "guid": "https://finbold.com/?p=255865",
      "published_on": 1761066199,
      "imageurl": "https://images.cryptocompare.com/news/default/finbold.png",
      "title": "Crypto trader with 100% win rate just went long on this crypto",
      "url": "https://finbold.com/crypto-trader-with-100-win-rate-just-went-long-on-this-crypto/",
      "body": "A highly profitable cryptocurrency trader boasting a 100% win rate and over $3.2 million in total profits has taken a massive bullish position on Ethereum ( ETH ). The trader opened a 4x leveraged long position worth $35 million, equivalent to 9,082 ETH, at an entry price of $3,875, according to onchain data shared by Lookonchain on October 21. Despite a minor unrealized loss of about $112,619 (-1.28%), the trader remains fully committed to a long position, maintaining 100% exposure to Ethereum. This trader, with $3.2M in total profit and a 100% win rate, just opened a 4x long on 9,082 $ETH ($35M). https://t.co/tNbDLgKwkV pic.twitter.com/AmFvE64snV — Lookonchain (@lookonchain) October 21, 2025 Historical data from the same wallet shows an impressive streak of profitable trades. In October alone, the trader secured multiple six-figure wins, including $1.14 million from a long ETH position closed on October 20 and another $1.38 million from a Bitcoin ( BTC ) long earlier in the month. Interestingly, the trader’s bullish outlook on Ethereum comes at a time when the second-largest cryptocurrency faces heightened volatility across the broader market . Ethereum rebounding Since the position was opened, Ethereum has shown renewed strength, reclaiming the $4,000 mark. The rebound coincides with easing ETF outflows and increased whale accumulation ahead of the U.S. CPI report on October 24. Outflows fell to $145 million from $311 million last week, signaling reduced selling pressure as traders hedge inflation risks with ETH. At the same time, excitement around the upcoming Fusaka upgrade on December 3, which is expected to double Layer 2 data capacity and cut fees by 40%, has added to bullish momentum. ETH price analysis By press time, Ethereum was trading at $4,103, up almost 4% in the past 24 hours, though still down about 1% on the weekly chart. ETH seven-day price chart. Source: Finbold With renewed bullish sentiment, market focus has now shifted to whether buyers can sustain Ethereum’s price above the critical $4,000 support level. The post Crypto trader with 100% win rate just went long on this crypto appeared first on Finbold .",
      "tags": "Cryptocurrency news|BTC|cryptocurrency|Ethereum",
      "lang": "EN",
      "upvotes": "0",
      "downvotes": "0",
      "categories": "BTC|ETH|MARKET|TRADING|CRYPTOCURRENCY",
      "source_info": {
        "name": "Finbold",
        "img": "https://images.cryptocompare.com/news/default/finbold.png",
        "lang": "EN"
      },
      "source": "finbold"
    },
    {
      "id": "53462628",
      "guid": "https://bitzo.com/2025/10/ethereum-price-prediction-eth-slips-below-4000-bulls-are-trapped",
      "published_on": 1761066051,
      "imageurl": "https://resources.cryptocompare.com/news/104/53462628.jpeg",
      "title": "Ethereum Price Prediction: ETH Slips Below $4000, Bulls are Trapped",
      "url": "https://bitzo.com/2025/10/ethereum-price-prediction-eth-slips-below-4000-bulls-are-trapped",
      "body": "Ethereum has once again slipped below the $4,000 mark, triggering widespread liquidations and highlighting mounting selling pressure in a risk-averse market. After multiple failed attempts to close above the critical $4,100 resistance, traders now face renewed downside risks as momentum indicators turn bearish. Outset PR's proprietary Outset Data Pulse intelligence offers a comprehensive analysis of crypto-native media performance, analogous to how crypto traders monitor fluctuations in ETH pricing. This capability enables PR campaigns to be strategically aligned with prevailing market trends and contexts. Repeated Rejections Trap Bulls at Key Resistance For the past week, Ethereum has struggled to break above the $4,100–$4,200 zone — a region many analysts associate with its 2020 breakout pattern. This persistent rejection has effectively trapped bullish traders, leaving leveraged positions vulnerable to liquidation. Source: coinmarketcap The RSI at 44.47 signals weakening momentum, while the MACD histogram (-24.68) confirms a bearish divergence, reinforcing the case for further correction. ETH is now retesting the 61.8% Fibonacci retracement at $3,954 — a crucial support level. A clear break below could open the path toward $3,750, a deeper retracement level last seen during early Q3 consolidations. Derivatives Show Risk-Off Behavior Market data underscores growing caution among traders. The crypto fear index sits at 33, reflecting elevated fear and risk aversion. Meanwhile, derivatives open interest dropped 3.26%, a sign that participants are scaling back leverage exposure amid uncertainty. ETH’s 24-hour liquidation heatmap recorded over $210 million in long positions wiped out near $4,000, intensifying bearish sentiment. This wave of forced selling has compounded volatility, pushing 7-day implied volatility to 47% — the highest in nearly two months. Traders appear to be unwinding positions aggressively rather than accumulating at dips, suggesting that short-term sentiment remains defensive. Presenting Yourself Without Overspending: How Outset PR Optimizes PR Budgets and Delivers Tangible Results The purpose of any PR campaign is to boost brand visibility. Traditionally, this has meant securing as many publications as possible, often with unpredictable outcomes. It was difficult to know how many readers would actually see a story, leaving much of PR to guesswork. Actually, it had been guesswork until analysts of Outset PR developed Syndication Map —a proprietary tool that identifies which outlets attract the most traffic and where a story is likely to achieve the strongest syndication lift. Senior Media Analyst Maximilian Fondé explains: If a company needs a top list article, we filter the table for media that publish this format, cross-check costs and placement conditions, and know within minutes which outlets to pitch. Over time, that builds into a comprehensive database of crypto-friendly publishers – something other players in the industry don't have right now. Smarter Campaigns, Lower Costs Campaigns built with Syndication Map are not about mass reach for its own sake. They are carefully crafted to serve specific goals. By narrowing the focus to the most effective outlets, Outset PR reduces unnecessary spending on low-impact publications. Another key factor is communication. Outset PR’s dedicated Media Relations team, led by Anastasia Anisimova , has earned the trust of leading outlets through professionalism and genuine relationships. Sincerity and friendliness are our core principles, earning us the trust of numerous media outlets. Unfortunately, not all agencies in our industry prioritize friendliness in their communications. Extended Reach Through Syndication Outset PR campaigns also achieve more visibility than clients initially pay for. Articles are frequently republished across aggregators and platforms such as CoinMarketCap and Binance Square, extending exposure far beyond the original placement. Well-placed articles can achieve up to ten times the outreach of the original post. The case of StealthEX demonstrates this effect clearly: targeted tier-1 pitching led to 92 republications across outlets including CoinMarketCap, Binance Square, and Yahoo Finance, generating a total outreach of over 3 billion. Outset PR Sets a New Standard Pitching to a major outlet like Cointelegraph still has value, but syndication often delivers far greater reach at a lower cost. Outset PR has mastered this strategy, combining proprietary tools, strong media relations, and syndication opportunities to deliver results backed by numbers. Ready to make your budget work smarter? Discover how targeted campaigns deliver verifiable results. 👉 Reach out to Outset PR Macro Headwinds Amplify Selling Pressure Ethereum’s technical weakness is unfolding against a backdrop of broader macro uncertainty. Rising Treasury yields, risk-off positioning in global markets, and a stronger U.S. dollar have collectively weighed on crypto liquidity. As Bitcoin dominance climbs, capital continues rotating out of altcoins, leaving ETH and other major assets exposed to deeper pullbacks. Unless Ethereum quickly reclaims the $4,100 resistance zone, the path of least resistance appears to remain downward. Short-term traders are now watching for reactions at $3,950–$3,750 to gauge whether the market can stabilize — or whether a deeper correction is in play. Outlook: Bulls on the Defensive In the near term, Ethereum’s outlook remains fragile. Technicals confirm a loss of bullish structure, derivatives data reflect reduced appetite for leverage, and sentiment has turned fearful. While oversold conditions could prompt a temporary bounce, sustained recovery will likely depend on broader market stabilization and a confirmed close above $4,100. Until then, ETH bulls remain trapped, and volatility may continue to dominate short-term price action. Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.",
      "tags": "More News|Altcoins",
      "lang": "EN",
      "upvotes": "0",
      "downvotes": "0",
      "categories": "ALTCOIN|ETH|MARKET|TRADING|CRYPTOCURRENCY",
      "source_info": {
        "name": "Bitzo",
        "img": "https://resources.cryptocompare.com/news/104/default.png",
        "lang": "EN"
      },
      "source": "bitzo"
    },
    {
      "id": "53462621",
      "guid": "https://timestabloid.com/?p=87132",
      "published_on": 1761066044,
      "imageurl": "https://resources.cryptocompare.com/news/67/default.png",
      "title": "BNB Touches $1,300 While PEPE Chases Its ATH and BlockDAG’s $0.0015 TGE Code Sparks a Market Turning Point",
      "url": "https://timestabloid.com/bnb-touches-1300-while-pepe-chases-its-ath-and-blockdags/",
      "body": "October 2025 has brought renewed activity across the crypto landscape, with BlockDAG, Binance Coin, and PEPE taking center stage. The Binance Coin (BNB) price has jumped to $1,300, reclaiming third place in market capitalization, while the PEPE coin price edges closer to a breakout that could set fresh highs. Amid this market strength, BlockDAG’s $0.0015 special price offer with the TGE Code has captured attention, signaling its final presale stage ahead of the awaited Genesis Day on November 26. Excitement for these top crypto coins continues to grow across online communities and global trading platforms. Each holds a unique position: BNB for its institutional strength, PEPE for its community-driven rally, and BlockDAG (BDAG) for its expanding hybrid Layer-1 design built for scalability. As the market heads into its final quarter of 2025, these combined factors highlight how innovation and liquidity together are shaping crypto’s next major cycle. PEPE Coin Targets Its Key Breakout Level The PEPE coin price is now nearing a key resistance zone after an extended consolidation period. Currently valued near $0.00001, it is forming a bullish wedge pattern that hints at potential upward momentum. Analysts suggest that a confirmed move above $0.00002 could push the PEPE coin price toward $0.00003, potentially setting a new all-time high. After a quiet first half of the year, renewed enthusiasm for top crypto coins like DOGE and PEPE has drawn traders back into meme markets. Sustaining support above $0.000008 remains crucial for this pattern to hold. If the PEPE coin price clears resistance with solid buying volume, analysts expect a strong meme-coin wave in Q4 2025. The community is closely watching this possible breakout. A decisive move could turn overall sentiment bullish, positioning PEPE among the top crypto coins to watch as 2025 comes to a close. BNB Hits $1,300 and Secures Third Place in Market Ranking The Binance Coin (BNB) price has surged to $1,326, overtaking XRP to become the third-largest cryptocurrency with a market value surpassing $182 billion. The coin recorded an impressive 28% weekly rise, adding over $40 billion in capitalization and outperforming Bitcoin’s smaller 5% increase. Reports indicate that CEA Industries now holds 480,000 BNB tokens valued at about $585 million, aiming to accumulate 1% of BNB’s total supply before the year ends. This move reflects strong confidence in Binance’s expanding ecosystem. With over 60 million monthly active addresses on BNB Chain and new government-supported initiatives in Kazakhstan, BNB’s fundamentals remain solid. The current price movement has also drawn comparisons to its 2021 rally, suggesting possible continued gains. Whether driven by increased usage or speculative activity, Binance Coin remains one of the top crypto coins fueling the market’s bullish tone in Q4 2025. BlockDAG’s $0.0015 Price and TGE Code Begin the Final Phase While the Binance Coin (BNB) price and PEPE coin price remain at the center of exchange discussions, BlockDAG is preparing for its most significant milestone yet, Genesis Day, scheduled for November 26. Currently in Batch 31 with a special presale price of $0.0015, the project has raised over $430 million, ranking among the most successful presales of 2025. BlockDAG will connect with Binance in a highly anticipated AMA on Friday, October 24, at 3 PM UTC. This milestone session promises roadmap progress, insider updates, and a closer look at Keynote 4 and GENESIS DAY. With BDAG holding at $0.0015 in Batch 31, code “TGE” is the last chance to maximize earnings before the dashboard upgrade and price increase. The introduction of the TGE Code marks the last acceleration phase before the mainnet launch and exchange listings. It rewards early buyers with a rank-based airdrop system, giving them priority access once trading begins. Beyond the growing interest, BlockDAG continues to make measurable progress. Global distribution of its mining devices has scaled, with more than 20,000 X-Series units shipped and operational worldwide. Together with 3.5 million X1 mobile app users, these figures highlight how fast the ecosystem is expanding. From a technical standpoint, EVM compatibility remains one of its strongest advantages. This feature enables Ethereum-based projects to shift smoothly to BlockDAG, gaining lower transaction costs and faster performance. Combined with its hybrid PoW and DAG design, developers can deploy smart contracts easily while ensuring scalability and reliability. As the top crypto coins compete for visibility, BlockDAG’s $0.0015 presale and TGE Code stand out for their focus on openness, verified hardware, and active adoption. With Genesis Day fast approaching, its progress reflects not just excitement but readiness to enter the market with real functionality from day one. Final Takeaway! The rising momentum across top crypto coins shows where market interest is heading. The PEPE coin price is nearing a potential breakout, signaling possible volatility and opportunity. The Binance Coin (BNB) price remains strong above $1,300, supported by consistent network expansion and global participation. Meanwhile, BlockDAG’s $0.0015 presale price continues to attract attention as it moves toward Genesis Day, backed by tangible results like shipped miners, EVM support, and a confirmed launch roadmap. Together, these shifts highlight the diversity shaping Q4’s crypto outlook, blending meme-driven excitement, strong network infrastructure, and growing adoption. As the countdown continues, one fact is clear: whether it’s PEPE’s humor, BNB’s dominance, or BlockDAG’s precision, these three represent the driving energy behind the top crypto coins leading the market into 2025’s final quarter. Presale: https://purchase.blockdag.network Website: https://blockdag.network Telegram: https://t.me/blockDAGnetworkOfficial Discord: https://discord.gg/Q7BxghMVyu Disclaimer: This is a sponsored press release for informational purposes only. It does not reflect the views of Times Tabloid, nor is it intended to be used as legal, tax, investment, or financial advice. Times Tabloid is not responsible for any financial losses. The post BNB Touches $1,300 While PEPE Chases Its ATH and BlockDAG’s $0.0015 TGE Code Sparks a Market Turning Point appeared first on Times Tabloid .",
      "tags": "Finance|News",
      "lang": "EN",
      "upvotes": "0",
      "downvotes": "0",
      "categories": "MARKET|TRADING|BNB|PEPE|CRYPTOCURRENCY",
      "source_info": {
        "name": "TimesTabloid",
        "img": "https://resources.cryptocompare.com/news/67/default.png",
        "lang": "EN"
      },
      "source": "timestabloid"
    },
    {
      "id": "53462594",
      "guid": "https://www.newsbtc.com/?p=841120",
      "published_on": 1761066043,
      "imageurl": "https://resources.cryptocompare.com/news/21/53462594.jpeg",
      "title": "Pundit Outlines The Possibility Of The XRP Price Getting To $1,000",
      "url": "https://www.newsbtc.com/analysis/xrp/xrp-price-getting-to-1000/",
      "body": "A recent post by XRP commentator Remi Relief on the social media platform X has looked into the possibility of XRP’s price reaching the $1,000 price level. XRP is currently trading well below even the double-digit mark. However, according to this crypto commentator, XRP can get to $1,000, and the world doesn’t need to wait until 2030 for this to happen. Vision Of XRP’s Global Purpose In his post, Remi Relief questioned the widespread belief that a $1,000 price target could only be achieved by XRP by 2030. The timeline for XRP to reach $1,000 is going to be far less than that, with the analyst noting that the global economy is moving too quickly for it to take that long. He described the altcoin’s rise as something far bigger than predictions, and this is because the cryptocurrency is set to play an important role in stabilizing the world’s financial system. Related Reading: XRP Price To Crash 40%? Analyst Reveals Worst-Case Scenario Remi Relief’s outlook places XRP at the core of a growing realignment in the world’s financial system. “It’s going that high for the world’s sake,” he said. He contends that the cryptocurrency’s growth is tied to a global effort to rebalance debt and liquidity. Hence, the recent price crashes we’ve seen with XRP and other cryptocurrencies are a deliberate play by institutional players to accumulate more XRP while smaller investors capitulate. According to Remi Relief, these shakeouts are deliberate and designed to clear the market so that major entities can assume dominance before the price finally explodes. He also suggested that political resistance, particularly from the Democratic Party in the United States, could slow or suppress XRP’s ascent, as maintaining control over the traditional banking system aligns with their interests. If such resistance succeeds, the token might fall short of the $1,000 target but could still reach between $100 and $300 before stabilizing. Nonetheless, this is an acceptable outcome given the current XRP price levels. What Must Align For The Altcoin To Reach $1,000 Extraordinary developments in both market structure and adoption would be required in order for XRP to reach a four-digit price level. Predictions like these, as we’ve seen from many XRP enthusiasts, are dependent on whether the token gains widespread adoption in the world’s financial ecosystem. Related Reading: XRP’s Most Important Week In History: Here’s What’s Coming For Ripple Institutional integration would have to expand to a scale where XRP becomes an indispensable liquidity bridge for global payments, central bank settlements, and large-value transfers. At the same time, demand from major financial institutions, including banks, fintech companies, and possibly even governments, would need to grow exponentially in order for this to be reflected in the XRP price. At the same time, a reduction in the liquid supply would be needed. This could happen through large-scale lockups, increased network utility, or widespread adoption in tokenized asset systems that reduce the circulating supply of XRP. In another post on the social media platform X, Remi Relief projected that the altcoin’s price could surge to $1,700 if it repeats its 2017/2018 performance. At the time of writing, XRP is trading at $2.42. Featured image from Peakpx, chart from Tradingview.com",
      "tags": "XRP|Democratic Party|Remi Relief|Ripple|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
      "lang": "EN",
      "upvotes": "0",
      "downvotes": "0",
      "categories": "ALTCOIN|TRADING|XRP|MACROECONOMICS|CRYPTOCURRENCY",
      "source_info": {
        "name": "NewsBTC",
        "img": "https://images.cryptocompare.com/news/default/newsbtc.png",
        "lang": "EN"
      },
      "source": "newsbtc"
    },
    {
      "id": "53462688",
      "guid": "https://nulltx.com/?p=152432",
      "published_on": 1761066038,
      "imageurl": "https://images.cryptocompare.com/news/default/nulltx.png",
      "title": "4 Top Bullish Cryptos to Buy Now: BlockDAG, LivLive, JetBolt, & Nexchain!",
      "url": "https://nulltx.com/4-top-bullish-cryptos-to-buy-now-blockdag-livlive-jetbolt-nexchain/",
      "body": "The search for the top bullish cryptos to buy now in 2025 is led by projects proving tangible progress before their main launches. Traders now favor coins backed by genuine tech and transparency instead of hype-driven narratives. Among the strongest performers are BlockDAG, LivLive, JetBolt, and Nexchain, each bringing verified performance, solid ecosystems, and measurable development milestones. BlockDAG’s $430 million crypto presale and hybrid DAG-PoW structure highlight its scalability and efficiency. LivLive introduces Proof-of-Presence technology, rewarding verified real-world activity. JetBolt pioneers zero-gas Web3 transactions, while Nexchain integrates AI for faster, smarter automation. These top bullish cryptos to buy now redefine blockchain practicality and credibility for 2025’s growth phase. 1. BlockDAG: $430M Presale, Binance AMA, & Genesis Day Drive Massive Momentum Among the top bullish cryptos to buy now, BlockDAG (BDAG) has set a new record by raising over $430 million and selling 27 billion coins before its mainnet launch. Its hybrid design merges Bitcoin’s Proof-of-Work reliability with a Directed Acyclic Graph framework, creating a secure, scalable, and decentralized ecosystem. This model successfully resolves the blockchain trilemma, achieving high throughput while maintaining stability. The Awakening Testnet, already live and fully EVM-compatible, supports developers in testing dApps under a high-speed and safe network. Currently in Batch 31, BDAG’s listed presale price stands at $0.0304, but through the limited-time TGE code, it’s available at just $0.0015. Over 312,000 holders, 3 million mobile miners, and more than 20,000 shipped X-series miners demonstrate real-world traction. Moreover, BlockDAG’s global recognition through its alliance with the BWT Alpine Formula 1® Team and security audits from CertiK and Halborn further cement its credibility. As the presale nears completion, BlockDAG’s transparency, scalability, and verified ecosystem make it a clear leader among the top bullish cryptos to buy now, showing why experts project massive gains leading up to its $0.05 launch listing. BlockDAG is also set to go LIVE on Binance for an exclusive AMA this Friday, October 24 at 3PM UTC, marking one of its biggest global appearances yet. The session will feature insider updates, new roadmap reveals, and major insights ahead of Keynote 4: The Launch Note and GENESIS DAY. This is the moment the crypto world will be watching closely as BlockDAG takes the stage with Binance to unveil what’s next for its $430M+ ecosystem. The clock is ticking; secure your position before this milestone event ignites the next major wave of momentum. 2. LivLive: Linking Real-World Activity to Digital Rewards LivLive takes a fresh approach by letting users earn $LIVE coins through verified real-life actions. Using Proof-of-Presence technology integrated with AR and wearables, participants receive rewards for attending brand-linked activities or completing missions. This builds a bridge between businesses and audiences, transforming engagement into digital earning opportunities. The project replaces passive advertising with interaction-driven campaigns, where brands directly reward user involvement. LivLive’s presale, priced at $0.02, has already crossed $2 million in funding, with 65% of its 5 billion supply allocated to the community via quests and presales. Analysts predict a $0.20 potential listing, promising early participants significant growth. Its ongoing Treasure Vault promotions and referral programs sustain attention, reinforcing its place among the top bullish cryptos to buy now in 2025. 3. JetBolt: Fueling the Gasless Web3 Revolution High transaction fees have long slowed blockchain adoption, but JetBolt offers a seamless fix. Operating on the Skale Network, it provides zero-gas, instant transactions while maintaining full decentralization. Serving as a transparent bridge between apps and blockchains, JetBolt simplifies user access to Web3 while ensuring top-tier security. The JBOLT token, built as an ERC-20 asset, has already sold 360 million units, generating more than $3 million in presale funds. Early contributors enjoy up to 25% bonuses, and its marketing focuses on fast, no-cost operations that appeal to both developers and end users. With AI optimization reducing latency, JetBolt’s framework is designed for smooth adoption. As a contender among the top bullish cryptos to buy now, its focus on zero-gas usability positions it for strong, lasting demand. 4. Nexchain: Merging AI and Blockchain for Superior Speed Nexchain stands out for its AI-enhanced blockchain system that reaches speeds up to 400,000 transactions per second with minimal costs of $0.001. Its hybrid AI-Proof-of-Stake consensus dynamically adjusts for network efficiency, while “Smart Contracts 2.0” optimize performance in real time. Nexchain focuses on automating industries like logistics, finance, and data sharing. By mid-October 2025, Nexchain had secured over $8 million in presale funding and is in Stage 24 at $0.096, targeting a $0.30 launch listing. Its verified audits from SolidProof and CertiK, plus a $5 million airdrop and an upcoming AI-integrated testnet, mark major progress. These milestones make Nexchain one of the top bullish cryptos to buy now, promising exceptional utility and performance gains. Final Takeaway Each of these four, BlockDAG, LivLive, JetBolt, and Nexchain, demonstrates how technology, trust, and tangible progress drive the top bullish cryptos to buy now narrative in 2025. BlockDAG dominates with its massive presale, cutting-edge hybrid model, and real-world validation. LivLive gamifies engagement, JetBolt powers zero-cost transactions, and Nexchain refines blockchain speed with AI. With the Binance AMA on October 24, Genesis Day on November 26, and its TGE price still just $0.0015, BlockDAG is the clear frontrunner among 2025’s top bullish cryptos to buy now. Moreover, BlockDAG’s solid technology and expanding global network make it a standout among the top bullish cryptos to buy now. Disclosure: This is a sponsored press release. Please do your research before buying any cryptocurrency or investing in any projects. Read the full disclosure here .",
      "tags": "Press Releases",
      "lang": "EN",
      "upvotes": "0",
      "downvotes": "0",
      "categories": "BLOCKCHAIN|EXCHANGE|TRADING|BNB|CRYPTOCURRENCY",
      "source_info": {
        "name": "NullTx",
        "img": "https://images.cryptocompare.com/news/default/nulltx.png",
        "lang": "EN"
      },
      "source": "themerkle"
    },
    {
      "id": "53462624",
      "guid": "https://ambcrypto.com/?p=539130",
      "published_on": 1761066027,
      "imageurl": "https://images.cryptocompare.com/news/default/ambcrypto.png",
      "title": "Tom Lee’s BitMine scoops $250 mln in Ethereum: ‘Given the expected…’",
      "url": "https://ambcrypto.com/tom-lees-bitmine-scoops-250-mln-in-ethereum-given-the-expected-supercycle/",
      "body": "There was a broader trend of net accumulation as ETH consolidates above $3.5k",
      "tags": "Altcoin|Ethereum|News|News 1|Social|Trading View",
      "lang": "EN",
      "upvotes": "0",
      "downvotes": "0",
      "categories": "ALTCOIN|ETH|CRYPTOCURRENCY",
      "source_info": {
        "name": "AMB Crypto",
        "img": "https://images.cryptocompare.com/news/default/ambcrypto.png",
        "lang": "EN"
      },
      "source": "ambcrypto"
    },
    {
      "id": "53462649",
      "guid": "https://news.bitcoin.com/?p=763286&preview=true&preview_id=763286",
      "published_on": 1761066023,
      "imageurl": "https://resources.cryptocompare.com/news/14/53462649.jpeg",
      "title": "Molecooles: Empowering Women in Blockchain Through the First Decentralized Beauty Biohacking Club",
      "url": "https://news.bitcoin.com/molecooles-empowering-women-in-blockchain-through-the-first-decentralized-beauty-biohacking-club/",
      "body": "This content is provided by a sponsor. Molecooles introduces a transformative vision where beauty emerges as a new form of currency. As the world’s first decentralized beauty biohackers club, the platform harnesses cutting-edge trends and innovative technologies to create a premium longevity wellness brand. It equips users with a personal AI doctor, functioning like an",
      "tags": "Branded Spotlight",
      "lang": "EN",
      "upvotes": "0",
      "downvotes": "0",
      "categories": "BLOCKCHAIN",
      "source_info": {
        "name": "Bitcoin.com",
        "img": "https://images.cryptocompare.com/news/default/bitcoincom.png",
        "lang": "EN"
      },
      "source": "bitcoin.com"
    },
    {
      "id": "53462510",
      "guid": "https://en.coinotag.com/openais-mercury-project-could-train-ai-for-financial-modeling-with-ex-bankers/",
      "published_on": 1761065880,
      "imageurl": "https://resources.cryptocompare.com/news/77/53462510.jpeg",
      "title": "OpenAI’s Mercury Project Could Train AI for Financial Modeling With Ex-Bankers",
      "url": "https://en.coinotag.com/openais-mercury-project-could-train-ai-for-financial-modeling-with-ex-bankers/",
      "body": "OpenAI’s Mercury project mobilizes more than 100 former investment bankers to train finance-focused AI models by feeding real-world deal data, formatting, and modeling logic. Payment is about $150 per hour;",
      "tags": "Analysis|News|FLOW",
      "lang": "EN",
      "upvotes": "0",
      "downvotes": "0",
      "categories": "MARKET|FLOW",
      "source_info": {
        "name": "CoinOtag",
        "img": "https://resources.cryptocompare.com/news/77/default.png",
        "lang": "EN"
      },
      "source": "coinotag"
    },
    {
      "id": "53462509",
      "guid": "https://en.bitcoinsistemi.com/donald-trump-talks-about-tariffs-on-china-again-we-may-not-see-each-other-hot-moments/",
      "published_on": 1761065829,
      "imageurl": "https://resources.cryptocompare.com/news/81/53462509.jpeg",
      "title": "Donald Trump Talks About Tariffs on China Again! \"We May Not See Each Other\" – HOT MOMENTS",
      "url": "https://en.bitcoinsistemi.com/donald-trump-talks-about-tariffs-on-china-again-we-may-not-see-each-other-hot-moments/",
      "body": "US President Donald Trump announced that he will meet with Chinese President Xi Jinping in South Korea in two weeks. Trump stated that many issues would be discussed during the meeting, saying, “China wants to negotiate with us. We will make a great trade deal.” Trump, in a statement following China's recent expansion of export controls on rare earths, said the US is held in “great respect” by Beijing. Speaking after meeting with Australian Prime Minister Anthony Albanese at the White House, Trump described the new agreement with Australia as a significant step toward challenging China's dominance of these critical minerals. In addition, Donald Trump added that there may not be a meeting with Chinese President Xi Jinping. Bitcoin price movement after Trump's statement that there may be no talks with China. Related News: Is This the Reason Behind Bitcoin's Recent Rise? There's a Progress Related to the Ukraine-Russia War “The trade deal will be great for both countries, and even for the world,” Trump said, arguing that tariffs are part of national security. “We can start paying off our debt with tariffs,” he said. Trump also stated that he has ended eight wars so far, adding, “The ninth is on the way, the Ukraine-Russia war.” Meanwhile, the White House announced that no meeting between Trump and Russian President Vladimir Putin is planned anytime soon. In a statement to CBS News, it was stated that Secretary of State Marco Rubio and Russian Foreign Minister Sergey Lavrov had a “productive phone call” but that a face-to-face summit is not currently on the agenda. Lavrov reportedly expressed surprise at the postponement of the summit but reiterated Moscow's commitment to “lasting peace.” *This is not investment advice. Continue Reading: Donald Trump Talks About Tariffs on China Again! \"We May Not See Each Other\" – HOT MOMENTS",
      "tags": "Economy|News",
      "lang": "EN",
      "upvotes": "0",
      "downvotes": "0",
      "categories": "ASIA|BTC|REGULATION|MACROECONOMICS|CRYPTOCURRENCY",
      "source_info": {
        "name": "BitcoinSistemi",
        "img": "https://resources.cryptocompare.com/news/81/default.png",
        "lang": "EN"
      },
      "source": "bitcoinsistemi"
    },
    {
      "id": "53462513",
      "guid": "https://cryptodaily.co.uk/2025/10/bitcoin-dominance-approaches-60-leaving-solana-behind-in-market-rotation",
      "published_on": 1761065642,
      "imageurl": "https://resources.cryptocompare.com/news/75/53462513.jpeg",
      "title": "Bitcoin Dominance Approaches 60%, Leaving Solana Behind in Market Rotation",
      "url": "https://cryptodaily.co.uk/2025/10/bitcoin-dominance-approaches-60-leaving-solana-behind-in-market-rotation",
      "body": "The crypto market took a mild downturn as investors shifted back toward Bitcoin, reflecting a broader risk-off sentiment. While the total crypto market capitalization slipped 1.1% (about $40 billion), Bitcoin’s dominance rose to 59%, marking a continued rotation of capital away from altcoins — with Solana (SOL) among the most affected. Outset PR closely monitors the performance of crypto-native media outlets, similar to how crypto traders track market dominance shifts. This is accomplished through its proprietary Outset Data Pulse intelligence reports, which allow PR campaigns to align with market momentum and context. Bitcoin Dominance Rises Amid Market Uncertainty Rising global risk aversion has driven investors toward Bitcoin as a perceived safe haven within crypto. The asset’s growing dominance underscores a pattern observed during previous consolidation phases — when capital tends to exit higher-beta altcoins in favor of BTC’s relative stability. As of time of writing, Bitcoin Dominance stood at 59% per CoinMarketCap data . This dynamic has weighed heavily on Solana and other large-cap alts, many of which have failed to maintain key technical levels amid waning speculative appetite. Solana Struggles to Maintain Momentum Solana has traded near $188, failing to sustain gains above $193, where a double-top pattern has formed — a bearish technical signal suggesting potential trend exhaustion. Momentum indicators reinforce this outlook: the MACD line (-8.5) now trails the signal line (-6.42), confirming a bearish divergence, while the RSI at 42.65 reflects neutral but deteriorating momentum. Traders have largely exited positions around the 7-day SMA ($189.77) and the 23.6% Fibonacci retracement level ($225.69), underscoring short-term caution. Presenting Yourself Without Overspending: How Outset PR Optimizes PR Budgets and Delivers Tangible Results The purpose of any PR campaign is to boost brand visibility. Traditionally, this has meant securing as many publications as possible, often with unpredictable outcomes. It was difficult to know how many readers would actually see a story, leaving much of PR to guesswork. Actually, it had been guesswork until analysts of Outset PR developed Syndication Map —a proprietary tool that identifies which outlets attract the most traffic and where a story is likely to achieve the strongest syndication lift. Senior Media Analyst Maximilian Fondé explains: If a company needs a top list article, we filter the table for media that publish this format, cross-check costs and placement conditions, and know within minutes which outlets to pitch. Over time, that builds into a comprehensive database of crypto-friendly publishers – something other players in the industry don't have right now. Smarter Campaigns, Lower Costs Campaigns built with Syndication Map are not about mass reach for its own sake. They are carefully crafted to serve specific goals. By narrowing the focus to the most effective outlets, Outset PR reduces unnecessary spending on low-impact publications. Another key factor is communication. Outset PR’s dedicated Media Relations team, led by Anastasia Anisimova , has earned the trust of leading outlets through professionalism and genuine relationships. Sincerity and friendliness are our core principles, earning us the trust of numerous media outlets. Unfortunately, not all agencies in our industry prioritize friendliness in their communications. Extended Reach Through Syndication Outset PR campaigns also achieve more visibility than clients initially pay for. Articles are frequently republished across aggregators and platforms such as CoinMarketCap and Binance Square, extending exposure far beyond the original placement. Well-placed articles can achieve up to ten times the outreach of the original post. The case of StealthEX demonstrates this effect clearly: targeted tier-1 pitching led to 92 republications across outlets including CoinMarketCap, Binance Square, and Yahoo Finance, generating a total outreach of over 3 billion. Outset PR Sets a New Standard Pitching to a major outlet like Cointelegraph still has value, but syndication often delivers far greater reach at a lower cost. Outset PR has mastered this strategy, combining proprietary tools, strong media relations, and syndication opportunities to deliver results backed by numbers. Ready to make your budget work smarter? Discover how targeted campaigns deliver verifiable results. 👉 Reach out to Outset PR Key Levels to Watch: SOL Faces Decline to $176 Support The $176 support zone now represents a critical threshold for SOL. A decisive breakdown below this level could trigger cascading liquidations, amplifying downside pressure as leveraged positions unwind. Conversely, if the broader market stabilizes and Bitcoin consolidates below the $115K–$120K zone, Solana could find temporary relief. However, sustained recovery would likely require renewed inflows into altcoins — something the rising Bitcoin dominance currently discourages. Outlook: Capital Rotation in Full Swing Solana’s recent underperformance illustrates the shifting dynamics within the crypto market. As institutional traders and funds rebalance portfolios amid tightening liquidity and macroeconomic uncertainty, Bitcoin continues to absorb capital, leaving alts vulnerable to extended consolidation or further corrections. Until sentiment toward higher-risk assets improves, BTC’s dominance may continue rising, reinforcing a defensive market tone and keeping pressure on Solana’s near-term outlook. Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.",
      "tags": "More News",
      "lang": "EN",
      "upvotes": "0",
      "downvotes": "0",
      "categories": "BTC|MARKET|SOL|TRADING|CRYPTOCURRENCY",
      "source_info": {
        "name": "Crypto Daily",
        "img": "https://resources.cryptocompare.com/news/75/default.png",
        "lang": "EN"
      },
      "source": "cryptodaily"
    },
    {
      "id": "53462477",
      "guid": "a152b3ce-c5ef-4686-9e71-04275db0cafd",
      "published_on": 1761065579,
      "imageurl": "https://resources.cryptocompare.com/news/5/53462477.jpeg",
      "title": "Filecoin Jumps More Than 4% After Retaking $1.60 Resistance Level",
      "url": "https://www.coindesk.com/markets/2025/10/21/filecoin-jumps-more-than-4-after-retaking-usd1-60-resistance-level",
      "body": "The token has support at the $1.52 level and resistance at $1.65.",
      "tags": "Markets|AI Market Insights|Filecoin|Technical Analysis|News",
      "lang": "EN",
      "upvotes": "0",
      "downvotes": "0",
      "categories": "FIL|MARKET",
      "source_info": {
        "name": "CoinDesk",
        "img": "https://resources.cryptocompare.com/news/5/default.png",
        "lang": "EN"
      },
      "source": "coindesk"
    },
    {
      "id": "53462483",
      "guid": "https://u.today/bitcoin-absolutely-crushing-gold-with-biggest-green-candle-since-april",
      "published_on": 1761065499,
      "imageurl": "https://resources.cryptocompare.com/news/64/53462483.jpeg",
      "title": "Bitcoin Absolutely Crushing Gold with Biggest Green Candle Since April",
      "url": "https://u.today/bitcoin-absolutely-crushing-gold-with-biggest-green-candle-since-april",
      "body": "Gold is getting pummeled while Bitcoin is finally catching a bid following a streak of underwhelming price performance",
      "tags": "Bitcoin Price Prediction|BTC",
      "lang": "EN",
      "upvotes": "0",
      "downvotes": "0",
      "categories": "BTC|FIAT|TRADING|CRYPTOCURRENCY",
      "source_info": {
        "name": "U.Today",
        "img": "https://images.cryptocompare.com/news/default/utoday.png",
        "lang": "EN"
      },
      "source": "utoday"
    },
    {
      "id": "53462294",
      "guid": "https://en.coinotag.com/german-fintech-aifinyo-targets-10000-btc-by-2027-in-corporate-treasury-shift/",
      "published_on": 1761065459,
      "imageurl": "https://resources.cryptocompare.com/news/77/default.png",
      "title": "German Fintech Aifinyo Targets 10,000 BTC by 2027 in Corporate Treasury Shift",
      "url": "https://en.coinotag.com/german-fintech-aifinyo-targets-10000-btc-by-2027-in-corporate-treasury-shift/",
      "body": "German fintech aifinyo AG has joined the Bitcoin for Corporations initiative, investing €3 million in Bitcoin and targeting 10,000 BTC by 2027. This move positions it as Germany’s first pure-play",
      "tags": "Bitcoin|News",
      "lang": "EN",
      "upvotes": "0",
      "downvotes": "0",
      "categories": "BTC|REGULATION|DIGITAL ASSET TREASURY|MACROECONOMICS|CRYPTOCURRENCY",
      "source_info": {
        "name": "CoinOtag",
        "img": "https://resources.cryptocompare.com/news/77/default.png",
        "lang": "EN"
      },
      "source": "coinotag"
    },
    {
      "id": "53462585",
      "guid": "https://www.cryptopolitan.com/?p=834611",
      "published_on": 1761065408,
      "imageurl": "https://resources.cryptocompare.com/news/43/53462585.jpeg",
      "title": "What Is Base? The Ethereum Layer-2 Network Launched by Coinbase",
      "url": "https://www.cryptopolitan.com/what-is-base-coinbase-layer-2/",
      "body": "This guide will provide an overview of Base, one of the leading Layer 2 chains, which is compatible with the Ethereum ecosystem. The network uses the Optimistic Rollups technology, which bundles transactions off-chain and submits them to Ethereum. Base Network Overview What Is Base in Simple Terms Base is a network that secures transactions using Ethereum’s infrastructure. The network operates as a second layer on top of Ethereum and uses the Optimistic Rollups technology, meaning all proposed transactions are considered valid. Base then posts the transactions on the next Ethereum block. Why Coinbase Launched Its Own Layer-2 Coinbase has shared its intention to create Base as initially an access point with lower fees. The company wanted to bring mass adoption with fun and accessible activities. Base was used as a venue to bring on-chain summer, a period of light-hearted meme trading and NFT launches. The network used that period to test its capacity, onboard users, and establish its presence among other Layer 2 chains. Base’s Role in the Ethereum Ecosystem Base’s main role lies in Ethereum Layer 2 scaling. The launch of Base arrived after Ethereum had a period of extremely high fees. Base solved that problem by carrying some of the traffic, inviting top apps to build new versions for the Layer 2 chain. How Base Works Built on the OP Stack (Optimism Technology) Base is built using components of the OP Stack, a framework by the Optimism Collective. This makes Base compatible with other similar chains, as cross-chain operations are one of the main goals of Base. The OP Stack makes Base a part of the Optimism Superchain, helping Ethereum handle more transactions while offering niche services for each new L2 chain. Security Through Ethereum Mainnet Settlement Base offers Ethereum L2 scaling by accepting much more transactions than a usual Ethereum block. The transactions are then batched and rolled up, using off-chain computation. This allows for processing hundrends of thousands of transactions. The transactions are then cryptographically processed to derive a Merkle root, ensuring the record is tamper-proof. The Merkle root is a unique number, which is then published as part of an Ethereum block. This ensures the record can be verified for tampering, and ensures that no parties on Base will change their transactions. To achieve this record, Base uses blobs, paying daily fees for posting on Ethereum. The fees paid to Ethereum vary based on general activity. Scalability Benefits (Lower Fees, Faster Transactions) Because Base can batch more transactions off-chain, while storing only the data from a single Merkle root, transaction fees are extremely low. Transactions are also instant, though there is some waiting time until they are final on Ethereum. However, most of the data processing and data transfers are not stored on the blockchain. Base produces a block every two seconds, meaning users have no sense of delay or long waiting times for confirmations. Features and Advantages of Base Coinbase Integration (Wallets, Exchange, Onboarding) Using Base is integrated with other Coinbase features, for both end users and developers. Users can create Base accounts through Smart Wallet features, storing a secure identity and access to all Base services. However, a Base identity does not replace a full-KYC Coinbase account. Every user of the Coinbase smart wallet also has a Base account by default. The wallet can hold all assets on the Base chain, and grant access to decentralized exchanges (DEXs) and other apps. Developer-Friendly Infrastructure One of the goals of Coinbase is to encourage app building. For that reason, the Base Account SDK is available to developers for integrated apps. Base is compatible with Ethereum, making it user-friendly for developers who use the Solidity programming language. Base products are also integrated with Coinbase’s features and data. Developers also have access to detailed documentation and the Base Ecosystem Fund, which supports early-stage projects. Open-Source, Permissionless Network Base offers open-source code to help expand the decentralized ecosystem. All resources for Base builders are freely available, with ready-made components for some of the most common tasks in decentralized applications (dApps). Base provides general payment components, building blocks, and trading components. Part of the “Superchain” Vision Base is inherently compatible with the Superchain Ecosystem. The Superchain encompasses other Optimistic Rollup networks, where Base aims to serve as a central hub and bridge. The Superchain is a system of shared protocols and separately developed modules, easily adaptable to the requirements of different projects. Base is thus opening channels for communication between chains, sharing resources, routing, trading, and more. Base vs Other Ethereum Layer-2s Base vs Optimism (Partnership and Shared Tech) Both Base and Optimism are optimistic rollup networks. The two chains have differences that make them specialized for their niche tasks. Base is optimized to handle a higher number of transactions per second (TPS), while Optimism handles 200 TPS. Both chains produce a block in two seconds, though Base has around 20% faster finality for its transfers. All other parameters of the networks are similar. Base is partnering with Optimism on governance. It will contribute 2.5% of its sequencer revenue or 15% of its net profits, in exchange for 118M OP tokens unlocked over a few years. Base vs Arbitrum (Differences in Ecosystem Growth) Base and Arbitrum have different growth rates, following a different approach to launching and user incentives. Arbitrum was among the first L2, relying on airdrop incentives. The launch of Arbitrum still required significant fees to be paid to Ethereum, which affected the chain’s growth trajectory. Arbitrum still accrued value and turned into one of the leading hubs for DeFi. Base grew its ecosystem through NFTs and memecoins, later expanding with stablecoins and its own versions of DeFi. As of 2025, Arbitrum and Base are not competing directly, as each one hosts its own niche dApps. Base vs zk-Rollups (ZKSync, StarkNet) Base uses Optimistic Rollups, meaning all transactions are presumed valid. Then, validators or the sequencer monitors the transactions for disparities. Zero-knowledge rollups take a different approach, using a validity proof that the transactions are real and valid. ZK-rollups require a complex mathematical proof and are more computationally expensive. Hence, Base has chosen the path of Optimistic Rollups with sequencer verification, to offer the fastest and cheapest way possible to scale Ethereum. Ecosystem and Adoption dApps Building on Base (DeFi, NFTs, Gaming) Base allows for the creation of many types of apps. The chain started its adoption with NFTs linked to each user’s Base identity. Later, the chain added DeFi apps, both multi-chain versions and native marketplaces. As of October 2025, Base carried 1.74M weekly active users, with up to 30% week-on-week growth, based on DappRadar data . Coinbase User Funnel (Fiat → Base Onboarding) All users of Coinbase Smart Wallets have a Base identity. The wallet offers Coinbase’s usual fiat on-ramp, which can also be integrated with other Base apps. The fiat on-ramp directs users to USDC ownership, the most widely used stablecoin on Base. USDC transfers are virtually free for Base users. The Coinbase infrastructure thus onboards new users and adds fresh liquidity to the Base chain. Partnerships and Developer Grants Base grows its ecosystem through the Base Ecosystem Grants for new projects. There are also additional resources for developers, boosting knowledge, visibility, marketing, and networking. Additional funding comes from the Base Builder Reward, as well as from the Paymaster Gas Credits program. Base also attempts to keep an open stack, partnering with other platforms and tool builders. The chain partnered with Aerodrome Finance, Animoca Brands, Alchemy, and other projects for specific tools or Web3 tasks. Base is a partner with the Optimism chain, one of the main Layer 2 venues for DeFi and fast on-chain activity. Risks and Criticisms of Base Centralization Concerns (Coinbase’s Influence) While Coinbase offers a strong selection of services, both for fiat and crypto, one of the criticisms of Base is that the chain is too tied up with the Coinbase culture. The chain predominantly encourages the usage of USDC , a stablecoin which can be frozen or censored. The influence of Coinbase may discourage some app builders from attempting to use Base as their main chain. Base is considered a Stage 1 chain, allowing for sequencer failure. However, Base still operates with a centralized sequencer that levies fees for ordering the transactions. Base defends its position in that the sequencer only orders approved transactions, while the actual on-chain content is decided by other apps and smart contracts. Nevertheless, the sequencer also allows Base to retain a significant part of fees for deploying the sequencer, while paying a minimal amount to Ethereum. Competition Among L2s L2 chains are numerous and diverse, with over 120 active networks. Multiple chains are competing for users, as well as for liquidity inflows. Base is closely competing with Arbitrum, which is still the leader in stablecoin inflows. The main focus of competition between L2 chains is transactions cost, as well as available apps. L2 chains host versions of lending protocols, each with a slightly higher yield, offering opportunities for arbitrage. Base partners with some networks like Optimism, while others try to build an independent user base. Base chain also competes for Solidity developers, though some of the apps are deployed on multiple chains. Growing activity on L2 is not harmful to Base, and may in fact grow exposure to all chains. L2 chains grab nearly 14% of economic activity in the Ethereum ecosystem, of which Base takes up its own share. Regulatory and Compliance Risks Base shares Coinbase’s culture of remaining as close to compliance as possible. The chain encourages the usage of USDC, which is MiCA compliant in the EU and is covered by the Genius Bill in the USA. Base is still a no-KYC chain, with the exception of specific Coinbase tasks, which may still require user verification. The Future of Base in 2025 and Beyond Growth of the Superchain Ecosystem The Superchain ecosystem has grown to carry nearly 700K smart contracts, locking in $5.5B in revenues, based on data from Dune Analytics. Base chain is the main driver of growth of the Superchain, followed by Optimism. Over time, the presence of Base solidified and even displaced smaller chains. The entire L2 ecosystem is constantly changing, as networks have different opportunities and incentives. In 2025, the state of the ecosystem showed most contracts were carried by Optimism, but most on-chain activity happened on Base. Potential for Mass Adoption via Coinbase’s User Base Base launched at a time when blockchain projects started seeking mass adoption, with a strong retail user base. The Base chain popularization started with mass minting of NFTs, followed by a summer of incentives and fun content. Over the years, Base chain evolved into a financial hub, a venue for payments, and an ecosystem for app-building activity. Role in Ethereum’s Scaling Roadmap Base is one of the most successful networks to take up some of the excess liquidity on Ethereum. The Ethereum roadmap includes both L1 and L2 efforts with the goal of achieving up to 100K transactions per second (TPS). Base for now carries around 1,500 TPS. L2 and especially optimistic rollups achieved unexpected scaling, when the Ethereum chain initially planned to go with sharding the chain. L2 rollups received some criticism that they took activity from Ethereum and paid back only limited fees. However, the ecosystem growth and app development have improved the standing of Ethereum, allowing users to tap DeFi , lending, DEX trading, and meme tokens without the burden of high gas fees and congestion. For that reason, Base chain is considered a part of Ethereum’s future, and not a competitor to L1 activity.",
      "tags": "Learn Crypto: Beginner Guides|ARB|Arbitrum|Base|Coinbase|ETH|Ethereum|OP|Optimism|USDC",
      "lang": "EN",
      "upvotes": "0",
      "downvotes": "0",
      "categories": "BLOCKCHAIN|ETH|EXCHANGE|ARB|CRYPTOCURRENCY",
      "source_info": {
        "name": "Cryptopolitan",
        "img": "https://images.cryptocompare.com/news/default/cryptopolitan.png",
        "lang": "EN"
      },
      "source": "cryptopolitan"
    },
    {
      "id": "53462246",
      "guid": "https://en.coinotag.com/rising-impersonation-scams-threaten-2025-crypto-landscape-including-bnb-chain/",
      "published_on": 1761065349,
      "imageurl": "https://resources.cryptocompare.com/news/77/default.png",
      "title": "Rising Impersonation Scams Threaten 2025 Crypto Landscape, Including BNB Chain",
      "url": "https://en.coinotag.com/rising-impersonation-scams-threaten-2025-crypto-landscape-including-bnb-chain/",
      "body": "Crypto impersonation scams in 2025 have surged, with fraudsters using fake journalist accounts, deepfake videos, and phishing tactics to steal data and funds. These schemes target investors, media, and regulators,",
      "tags": "News",
      "lang": "EN",
      "upvotes": "0",
      "downvotes": "0",
      "categories": "BUSINESS|BNB|CRYPTOCURRENCY",
      "source_info": {
        "name": "CoinOtag",
        "img": "https://resources.cryptocompare.com/news/77/default.png",
        "lang": "EN"
      },
      "source": "coinotag"
    },
    {
      "id": "53462182",
      "guid": "https://en.coinotag.com/bitcoin-whales-shift-billions-to-blackrocks-ibit-etf-potentially-signaling-institutional-adoption/",
      "published_on": 1761065235,
      "imageurl": "https://resources.cryptocompare.com/news/77/default.png",
      "title": "Bitcoin Whales Shift Billions to BlackRock’s IBIT ETF, Potentially Signaling Institutional Adoption",
      "url": "https://en.coinotag.com/bitcoin-whales-shift-billions-to-blackrocks-ibit-etf-potentially-signaling-institutional-adoption/",
      "body": "Bitcoin whales are transferring billions in holdings to spot Bitcoin ETFs like BlackRock’s IBIT, driven by institutional adoption and regulatory changes that enable efficient, tax-friendly conversions for large-scale investors. Over",
      "tags": "Analysis|Bitcoin|News",
      "lang": "EN",
      "upvotes": "0",
      "downvotes": "0",
      "categories": "BTC|BUSINESS|MARKET|CRYPTOCURRENCY",
      "source_info": {
        "name": "CoinOtag",
        "img": "https://resources.cryptocompare.com/news/77/default.png",
        "lang": "EN"
      },
      "source": "coinotag"
    },
    {
      "id": "53462140",
      "guid": "https://en.coinotag.com/sharplink-gaming-bolsters-ethereum-holdings-with-79-million-purchase-after-hiatus/",
      "published_on": 1761065113,
      "imageurl": "https://resources.cryptocompare.com/news/77/53462140.jpeg",
      "title": "SharpLink Gaming Bolsters Ethereum Holdings with $79 Million Purchase After Hiatus",
      "url": "https://en.coinotag.com/sharplink-gaming-bolsters-ethereum-holdings-with-79-million-purchase-after-hiatus/",
      "body": "SharpLink Gaming, an Ethereum treasury firm, recently purchased 19,271 ETH worth nearly $79 million at an average price of $3,892 per coin. This marks the company’s first crypto acquisition in",
      "tags": "News|ETH",
      "lang": "EN",
      "upvotes": "0",
      "downvotes": "0",
      "categories": "ETH|REGULATION|DIGITAL ASSET TREASURY|MACROECONOMICS|CRYPTOCURRENCY",
      "source_info": {
        "name": "CoinOtag",
        "img": "https://resources.cryptocompare.com/news/77/default.png",
        "lang": "EN"
      },
      "source": "coinotag"
    },
    {
      "id": "53462075",
      "guid": "https://en.coinotag.com/asi-alliance-faces-turmoil-as-ocean-protocols-fet-conversion-draws-misconduct-claims/",
      "published_on": 1761065000,
      "imageurl": "https://resources.cryptocompare.com/news/77/53462075.jpeg",
      "title": "ASI Alliance Faces Turmoil as Ocean Protocol’s $FET Conversion Draws Misconduct Claims",
      "url": "https://en.coinotag.com/asi-alliance-faces-turmoil-as-ocean-protocols-fet-conversion-draws-misconduct-claims/",
      "body": "Ocean Protocol’s conversion of 661 million $OCEAN tokens into 286 million $FET tokens, valued at $191 million, has sparked controversy within the ASI alliance. On-chain data from Bubblemaps reveals transfers",
      "tags": "Blockchain|News|FET",
      "lang": "EN",
      "upvotes": "0",
      "downvotes": "0",
      "categories": "BLOCKCHAIN|FET",
      "source_info": {
        "name": "CoinOtag",
        "img": "https://resources.cryptocompare.com/news/77/default.png",
        "lang": "EN"
      },
      "source": "coinotag"
    },
    {
      "id": "53462074",
      "guid": "https://en.coinotag.com/gold-and-silver-recoil-from-record-highs-as-bitcoin-edges-higher-markets-assess-safe-haven-and-economic-outlook/",
      "published_on": 1761064989,
      "imageurl": "https://resources.cryptocompare.com/news/77/53462074.jpeg",
      "title": "Gold and Silver Recoil From Record Highs as Bitcoin Edges Higher, Markets Assess Safe-Haven and Economic Outlook",
      "url": "https://en.coinotag.com/gold-and-silver-recoil-from-record-highs-as-bitcoin-edges-higher-markets-assess-safe-haven-and-economic-outlook/",
      "body": "Gold and silver price correction signals a broader repricing of risk assets, including crypto, as safe-haven demand eases and inflation expectations shift. The pullback suggests traders may rotate into higher-yield",
      "tags": "News|BTC",
      "lang": "EN",
      "upvotes": "0",
      "downvotes": "0",
      "categories": "BTC|FIAT|MARKET|MACROECONOMICS|CRYPTOCURRENCY",
      "source_info": {
        "name": "CoinOtag",
        "img": "https://resources.cryptocompare.com/news/77/default.png",
        "lang": "EN"
      },
      "source": "coinotag"
    },
    {
      "id": "53462511",
      "guid": "https://www.bloomberg.com/news/articles/2025-10-21/altcoins-stuck-below-post-ftx-low-as-crypto-risk-appetite-sinks",
      "published_on": 1761064924,
      "imageurl": "https://resources.cryptocompare.com/news/103/53462511.jpeg",
      "title": "Altcoins Stuck Below Post-FTX Low as Crypto Risk Appetite Sinks",
      "url": "https://www.bloomberg.com/news/articles/2025-10-21/altcoins-stuck-below-post-ftx-low-as-crypto-risk-appetite-sinks",
      "body": "The crypto market is stuck in post-liquidation limbo less than two weeks after a nearly $20 billion selloff triggered the largest single-day washout in the industry’s history.",
      "tags": "",
      "lang": "EN",
      "upvotes": "0",
      "downvotes": "0",
      "categories": "ALTCOIN|MARKET|CRYPTOCURRENCY",
      "source_info": {
        "name": "Bloomberg (Crypto)",
        "img": "https://resources.cryptocompare.com/news/103/default.png",
        "lang": "EN"
      },
      "source": "bloomberg_crypto_"
    },
    {
      "id": "53462582",
      "guid": "https://www.cryptopolitan.com/?p=841605",
      "published_on": 1761064916,
      "imageurl": "https://resources.cryptocompare.com/news/43/53462582.jpeg",
      "title": "GM beats Wall Street expectations, boosts 2025 guidance amid EV slowdown",
      "url": "https://www.cryptopolitan.com/general-motors-stock-rally-with-q3-beat/",
      "body": "General Motors lit up the market on Tuesday, blowing past Wall Street’s expectations for the third quarter and jacking up its full-year forecast for 2025. Traders didn’t blink — they bought. The stock jumped more than 15%, ripping toward its best day since 2020. It had closed at $58 on Monday. By noon Tuesday, the rally was in full gear. The automaker reported $2.80 in adjusted earnings per share, beating the $2.31 estimate.Revenue hit $48.59 billion, ahead of the expected $45.27 billion, and only slightly below the $48.76 billion it pulled in during the same period last year. Adjusted EBIT came in at $3.38 billion, way ahead of the $2.72 billion forecast. GM doesn’t count one-time items or non-core stuff in these numbers — they keep it clean. GM lifts 2025 guidance and slashes tariff hit With Q3 in the bag, General Motors raised the bar for the rest of the year. The company now expects adjusted EBIT between $12 billion and $13 billion, compared to the previous $10 billion to $12.5 billion. Adjusted EPS for the year moves up to $9.75 to $10.50, from $8.25 to $10. Automotive free cash flow is also getting an upgrade — $10 billion to $11 billion, up from $7.5 billion to $10 billion. That fourth-quarter outlook is looking spicy too. GM projects adjusted EPS between $1.64 and $2.39, with the midpoint at $2.02. That’s higher than analysts’ average target of $1.94. CEO Mary Barra told shareholders Tuesday, “Thanks to the collective efforts of our team, and our compelling vehicle portfolio, GM delivered another very good quarter of earnings and free cash flow. Based on our performance, we are raising our full-year guidance.” General Motors also trimmed its projected tariff hit for 2025. It now expects $3.5 billion to $4.5 billion in tariff impact, down from $4 billion to $5 billion. Barra gave credit to President Donald Trump for “the important tariff updates” announced last Friday. The new policy adds tariffs on imported medium- and heavy-duty trucks and parts, while extending a 3.75% offset for American-made vehicles. But it wasn’t all green arrows. The company took a $1.6 billion hit last week from scaling back its electric vehicle push. That charge wasn’t included in the adjusted numbers, but it still dragged net income for stockholders down to $1.3 billion, a 57% drop from last year’s $3.1 billion. Net income margin cratered to 2.7%, down from 6.3%. EV profit drags, NA margin slips, China rebounds On EVs, GM CFO Paul Jacobson told CNBC that only 40% of the company’s electric vehicles are profitable on a production level. That’s way lower than investors hoped. He warned that turning a profit on EVs will take longer, as adoption cools. “We do have some structural changes that we need to do to make sure that we lower the cost of producing those vehicles,” Jacobson said on “Squawk Box.” Still, General Motors gained ground in the EV market. According to Motor Intelligence, the company’s EV share jumped from 8.7% at the start of the year to 13.8% by the end of Q3. That pushed it ahead of Hyundai and Kia, which sit at 8.6%, but it’s still trailing Tesla by a mile. The North American business, which has been GM’s cash cow, made $2.5 billion in Q3, adjusted. That’s a drop from last year’s numbers, and the profit margin fell to 6.2%, down from 9.7%. Barra said Tuesday that her “top priority” is getting margins in North America back to 8% to 10%. That’ll take discipline in EV costs, production, pricing, and tariff exposure. What helped cover that margin slip? China. GM’s Chinese unit added $217 million more in profit than last year. Its international segment chipped in another $184 million in gains. GM Financial, the company’s lending arm, also pulled its weight — $804 million in adjusted earnings, up 17% from last year. Claim your free seat in an exclusive crypto trading community - limited to 1,000 members.",
      "tags": "Business|General Motors",
      "lang": "EN",
      "upvotes": "0",
      "downvotes": "0",
      "categories": "ASIA|BUSINESS|MARKET|TRADING|MACROECONOMICS",
      "source_info": {
        "name": "Cryptopolitan",
        "img": "https://images.cryptocompare.com/news/default/cryptopolitan.png",
        "lang": "EN"
      },
      "source": "cryptopolitan"
    },
    {
      "id": "53462047",
      "guid": "https://news.bitcoin.com/?p=765199",
      "published_on": 1761064821,
      "imageurl": "https://resources.cryptocompare.com/news/14/53462047.jpeg",
      "title": "Golden Hangover: Gold Prices Plummet After Touching $4,377 Peak",
      "url": "https://news.bitcoin.com/golden-hangover-gold-prices-plummet-after-touching-4377-peak/",
      "body": "On Tuesday, after gold gleamed its way up to $4,377 per troy ounce the day prior, the shine faded fast—slipping more than five percentage points—while silver decided to take the express elevator down even quicker. Gold and Silver Take a Harsh Hit Overnight Gold and silver have lost some of their edge in the past",
      "tags": "Markets and Prices|gold|markets and prices|silver",
      "lang": "EN",
      "upvotes": "0",
      "downvotes": "0",
      "categories": "FIAT|MARKET",
      "source_info": {
        "name": "Bitcoin.com",
        "img": "https://images.cryptocompare.com/news/default/bitcoincom.png",
        "lang": "EN"
      },
      "source": "bitcoin.com"
    },
    {
      "id": "53461906",
      "guid": "https://decrypt.co/?p=345209",
      "published_on": 1761064636,
      "imageurl": "https://resources.cryptocompare.com/news/44/53461906.jpeg",
      "title": "British Columbia Wants to Permanently Ban New Crypto Mining Sites",
      "url": "https://decrypt.co/345209/british-columbia-ban-crypto-mining-projects",
      "body": "The Canadian province says the move will protect clean energy for sectors creating jobs and growth.",
      "tags": "|Coins",
      "lang": "EN",
      "upvotes": "0",
      "downvotes": "0",
      "categories": "MINING",
      "source_info": {
        "name": "Decrypt",
        "img": "https://images.cryptocompare.com/news/default/decrypt.png",
        "lang": "EN"
      },
      "source": "decrypt"
    },
    {
      "id": "53461918",
      "guid": "https://en.coinotag.com/bitcoin-surpasses-113000-as-ethereum-and-altcoins-show-modest-gains-in-market-rebound/",
      "published_on": 1761064635,
      "imageurl": "https://resources.cryptocompare.com/news/77/53461918.jpeg",
      "title": "Bitcoin Surpasses $113,000 as Ethereum and Altcoins Show Modest Gains in Market Rebound",
      "url": "https://en.coinotag.com/bitcoin-surpasses-113000-as-ethereum-and-altcoins-show-modest-gains-in-market-rebound/",
      "body": "Bitcoin has reclaimed $113,000, surging to $113,200 amid a broader crypto market rebound on October 21, 2025. Ethereum trades at $4,060, while XRP gains 1.4% to $2.50, signaling renewed investor",
      "tags": "Analysis|News|ADA|AVAX|BNB|BTC|DOGE|ETH|HBAR|LINK|SOL|TRX|XRP",
      "lang": "EN",
      "upvotes": "0",
      "downvotes": "0",
      "categories": "ALTCOIN|BTC|ETH|MARKET|CRYPTOCURRENCY",
      "source_info": {
        "name": "CoinOtag",
        "img": "https://resources.cryptocompare.com/news/77/default.png",
        "lang": "EN"
      },
      "source": "coinotag"
    },
    {
      "id": "53461905",
      "guid": "https://decrypt.co/?p=345197",
      "published_on": 1761064540,
      "imageurl": "https://resources.cryptocompare.com/news/44/53461905.jpeg",
      "title": "SharpLink Makes First Ethereum Buy in Over a Month as ETH Holdings Top $3.5 Billion",
      "url": "https://decrypt.co/345197/sharplink-makes-first-ethereum-buy-month-eth-holdings-top-3-5-billion",
      "body": "Ethereum treasury firm SharpLink Gaming last week bought $79 million in ETH, marking its first crypto buy in over a month.",
      "tags": "|Markets",
      "lang": "EN",
      "upvotes": "0",
      "downvotes": "0",
      "categories": "ETH|MARKET|DIGITAL ASSET TREASURY|MACROECONOMICS|CRYPTOCURRENCY",
      "source_info": {
        "name": "Decrypt",
        "img": "https://images.cryptocompare.com/news/default/decrypt.png",
        "lang": "EN"
      },
      "source": "decrypt"
    },
    {
      "id": "53462259",
      "guid": "https://partner.cryptopolitan.com/toshi-bet-awards-its-largest-jackpot-ever-1000000-win-reaffirms-it-among-the-top-crypto-casinos/",
      "published_on": 1761064517,
      "imageurl": "https://resources.cryptocompare.com/news/43/53462259.jpeg",
      "title": "Toshi.bet Awards Its Largest Jackpot Ever — $1,000,000 Win Reaffirms It Among the Top Crypto Casinos",
      "url": "https://partner.cryptopolitan.com/toshi-bet-awards-its-largest-jackpot-ever-1000000-win-reaffirms-it-among-the-top-crypto-casinos/",
      "body": "October 16, 2025 — In a defining moment for the crypto gambling industry, Toshi.bet has just paid out its biggest jackpot to date — an eye-watering $1,000,000 . The win isn’t just historic; it’s proof that Toshi.bet has cemented its place among the best crypto casinos in the world — where big wins, provably fair play , and instant crypto withdrawals aren’t marketing promises but everyday realities. A Million-Dollar Win That Defines What’s Possible On October 10, 2025 , one lucky player made Toshi.bet history by hitting the platform’s largest-ever payout on one of its flagship slot games. It’s a win that goes beyond the numbers — a moment that captures why crypto casinos like Toshi.bet are redefining what modern gaming can be: transparent, rewarding, and truly borderless. “We built Toshi.bet to be a place where real wins happen — not just in theory, but in practice,” said Jordan, spokesperson for Toshi.bet. “This million-dollar payout represents everything we stand for: fairness, innovation, and giving our players a genuine shot at life-changing rewards.” Why This Win Matters for the Future of Crypto Gambling 1. A Landmark Moment for Player Trust In an era where online casinos face scrutiny over transparency, Toshi.bet’s verified $1,000,000 payout reinforces one clear message — crypto casinos can be fair, transparent, and reliable . Every spin, every payout, and every transaction on Toshi.bet is powered by blockchain-backed verification , ensuring that trust isn’t just earned — it’s built into the system itself. 2. Setting New Standards for the Industry While many platforms boast about “big wins,” few can actually deliver them at scale. Toshi.bet’s massive payout highlights its deep liquidity , secure treasury , and ability to process large wins instantly — without disruption. This is what separates a real top crypto casino from hype-driven imitators. It’s a rare example of financial strength meeting fair play. 3. Real-World Impact Beyond the Numbers A jackpot of this scale doesn’t just change one player’s life — it shifts the entire conversation around crypto gaming . It encourages new users to explore the possibilities, reassures existing players that the system works, and pushes competitors to raise their standards. With provably fair gameplay , no KYC (where allowed) , and instant crypto withdrawals , Toshi.bet is showing that transparency and scale can coexist — and thrive. 4. Where Integrity Meets Innovation Most crypto casinos offer speed and anonymity. Toshi.bet adds something rarer: integrity . Through provably fair systems and transparent, well-audited treasury management, the platform ensures that players enjoy both the thrill of gaming and the security of knowing they’re protected. This milestone win reinforces Toshi.bet’s growing reputation as the best US crypto casino where fairness, technology, and trust go hand-in-hand. What Made This Win Possible Deep Liquidity and Robust Treasury Paying out a million dollars in crypto isn’t easy. Toshi.bet’s sophisticated treasury system ensures liquidity stability even after massive wins. Operating exclusively with cryptocurrencies such as BTC, ETH, USDT, SOL, USDC, BNB, DOGE, and DASH , Toshi.bet eliminates conversion delays and payout risks common in fiat-based systems. Provably Fair and Player-First Design Every bet on Toshi.bet can be verified. The provably fair algorithm gives players control and confidence in each outcome — an industry first at this scale. Combined with a no KYC policy in select regions, the platform provides both privacy and fairness without compromise. Bonuses, Rakeback, and Rewards From a 200% first deposit bonus to a unique rakeback system that rewards both winners and losers, Toshi.bet is engineered for long-term player engagement. The million-dollar payout amplifies that value — showing that bonuses aren’t empty promises, but real multipliers of opportunity. A World-Class Game Selection Toshi.bet partners with elite developers such as Pragmatic Play and BGaming , offering a selection of high-volatility games where big multipliers and real wins meet. It’s a catalog built for entertainment — and for the possibility of hitting it big, just like this record-breaking winner. A Message to the Global Crypto Gaming Community As one of the few no KYC crypto casinos offering instant withdrawals and provably fair systems , Toshi.bet continues to redefine what modern online gambling can be. This $1,000,000 jackpot isn’t just a headline — it’s proof of Toshi.bet’s mission: to make crypto gaming trustworthy, exciting, and truly rewarding . With deep liquidity , blockchain transparency , and a growing global audience , Toshi.bet stands as one of the top BTC casinos leading the next wave of innovation in crypto gaming. About Toshi.bet Toshi.bet is a next-generation crypto casino offering a secure, transparent, and provably fair gaming experience. With games from world-class providers, instant crypto payouts, and one of the most rewarding bonus systems in the market, Toshi.bet has quickly emerged as a favorite among players seeking real value and reliability. Operating globally, Toshi.bet supports English, Spanish, Russian, Turkish, Japanese, Chinese, and Polish — welcoming players from around the world to experience the future of crypto gaming.",
      "tags": "Press Release",
      "lang": "EN",
      "upvotes": "0",
      "downvotes": "0",
      "categories": "BTC|REGULATION|DIGITAL ASSET TREASURY|MACROECONOMICS|CRYPTOCURRENCY",
      "source_info": {
        "name": "Cryptopolitan",
        "img": "https://images.cryptocompare.com/news/default/cryptopolitan.png",
        "lang": "EN"
      },
      "source": "cryptopolitan"
    },
    {
      "id": "53461809",
      "guid": "https://en.coinotag.com/maple-finance-and-aave-partner-to-integrate-syrupusd-into-on-chain-lending-markets/",
      "published_on": 1761064389,
      "imageurl": "https://resources.cryptocompare.com/news/77/53461809.jpeg",
      "title": "Maple Finance and Aave Partner to Integrate syrupUSD into On-Chain Lending Markets",
      "url": "https://en.coinotag.com/maple-finance-and-aave-partner-to-integrate-syrupusd-into-on-chain-lending-markets/",
      "body": "The Maple Finance and Aave partnership integrates institutional-grade credit products into Aave’s decentralized lending markets, bridging traditional finance with DeFi. This collaboration introduces yield-bearing stablecoins like syrupUSDT and syrupUSDC, enhancing",
      "tags": "News|Aave|ARB|Core",
      "lang": "EN",
      "upvotes": "0",
      "downvotes": "0",
      "categories": "MARKET|ARB|CRYPTOCURRENCY",
      "source_info": {
        "name": "CoinOtag",
        "img": "https://resources.cryptocompare.com/news/77/default.png",
        "lang": "EN"
      },
      "source": "coinotag"
    },
    {
      "id": "53461743",
      "guid": "https://en.bitcoinsistemi.com/is-this-the-reason-behind-bitcoins-recent-rise-theres-a-progress-related-to-the-ukraine-russia-war/",
      "published_on": 1761064329,
      "imageurl": "https://resources.cryptocompare.com/news/81/53461743.jpeg",
      "title": "Is This the Reason Behind Bitcoin’s Recent Rise? There’s a Progress Related to the Ukraine-Russia War",
      "url": "https://en.bitcoinsistemi.com/is-this-the-reason-behind-bitcoins-recent-rise-theres-a-progress-related-to-the-ukraine-russia-war/",
      "body": "Bitcoin (BTC) price reached $113,535 with the increase experienced during the day and gained 1.99% in the last 24 hours. Immediately following this rise in the crypto market, there was a remarkable diplomatic development regarding the Russia-Ukraine war. European countries are developing a 12-point peace proposal to end Russia's war with Ukraine, based on existing front lines. The plan will be overseen by a peace committee to be formed under the chairmanship of US President Donald Trump. The plan calls for Russia and Ukraine to agree to a ceasefire, halt territorial gains by both sides, and return exiled children to Ukraine. It also includes a prisoner exchange, security guarantees for Ukraine, and funding for post-war repairs. Related News: BREAKING: Coinbase Announces It Will List a New Altcoin - Price Jumps Significantly While sanctions against Russia are planned to be gradually lifted, approximately $300 billion in frozen reserves will be returned only if Moscow agrees to contribute to Ukraine's reconstruction. If Russia attacks again, the sanctions will automatically be reinstated. Last week, Trump called for a freeze on the war “at the current front lines,” saying, “Enough blood has been spilled. Everyone should stay put, go home, and stop killing.” The US president also announced that he would meet with Russian President Vladimir Putin in Budapest in the coming weeks. Ukrainian President Volodymyr Zelenskyy, for his part, stated that Trump's efforts were important in bringing peace closer, saying, “We are a little closer to ending this war. Trump has achieved many successes in the Middle East, and now he wants to use that momentum to end the Russia-Ukraine war.” European Union leaders also backed calls for a ceasefire along existing lines and the resumption of peace talks. New sanctions against Russia and the use of frozen assets to benefit Ukraine will be on the agenda of Thursday's summit in Brussels. The Russian side has so far rejected offers to freeze the war along existing front lines. Kremlin spokesman Dmitry Peskov said, “We have a difficult period ahead, but preparations are being carried out seriously.” *This is not investment advice. Continue Reading: Is This the Reason Behind Bitcoin’s Recent Rise? There’s a Progress Related to the Ukraine-Russia War",
      "tags": "Analysis|Bitcoin|News",
      "lang": "EN",
      "upvotes": "0",
      "downvotes": "0",
      "categories": "BTC|MARKET|REGULATION|MACROECONOMICS|CRYPTOCURRENCY",
      "source_info": {
        "name": "BitcoinSistemi",
        "img": "https://resources.cryptocompare.com/news/81/default.png",
        "lang": "EN"
      },
      "source": "bitcoinsistemi"
    },
    {
      "id": "53461820",
      "guid": "https://cointelegraph.com/news/bitcoin-whales-move-into-etfs-blackrock-ibit?utm_source=rss_feed&utm_medium=rss%3F_refresh%3Dhaxdyy%26_nocache%3D1761064433284&utm_campaign=rss_partner_inbound",
      "published_on": 1761064320,
      "imageurl": "https://images.cryptocompare.com/news/default/cointelegraph.png",
      "title": "Bitcoin whales quietly embrace BlackRock ETF following SEC rule change",
      "url": "https://cointelegraph.com/news/bitcoin-whales-move-into-etfs-blackrock-ibit?utm_source=rss_feed&utm_medium=rss%3F_refresh%3Dhaxdyy%26_nocache%3D1761064433284&utm_campaign=rss_partner_inbound",
      "body": "Bitcoin’s biggest holders are moving billions into ETFs like BlackRock’s IBIT, signaling a new phase of institutional adoption.",
      "tags": "",
      "lang": "EN",
      "upvotes": "0",
      "downvotes": "0",
      "categories": "BTC|REGULATION|CRYPTOCURRENCY",
      "source_info": {
        "name": "Cointelegraph",
        "img": "https://images.cryptocompare.com/news/default/cointelegraph.png",
        "lang": "EN"
      },
      "source": "cointelegraph"
    },
    {
      "id": "53461744",
      "guid": "https://en.coinotag.com/sbi-holdings-invests-200-million-in-evernorth-to-advance-xrp-adoption/",
      "published_on": 1761064317,
      "imageurl": "https://resources.cryptocompare.com/news/77/53461744.jpeg",
      "title": "SBI Holdings Invests $200 Million in Evernorth to Advance XRP Adoption",
      "url": "https://en.coinotag.com/sbi-holdings-invests-200-million-in-evernorth-to-advance-xrp-adoption/",
      "body": "SBI Holdings has invested $200 million in Evernorth, an institutional vehicle designed to boost XRP adoption by building a massive public XRP treasury through open-market purchases and DeFi strategies. SBI’s",
      "tags": "News|Ripple|ETH|XRP",
      "lang": "EN",
      "upvotes": "0",
      "downvotes": "0",
      "categories": "ETH|XRP|DIGITAL ASSET TREASURY|MACROECONOMICS|CRYPTOCURRENCY",
      "source_info": {
        "name": "CoinOtag",
        "img": "https://resources.cryptocompare.com/news/77/default.png",
        "lang": "EN"
      },
      "source": "coinotag"
    },
    {
      "id": "53461929",
      "guid": "https://www.cryptopolitan.com/?p=841607",
      "published_on": 1761064262,
      "imageurl": "https://resources.cryptocompare.com/news/43/53461929.jpeg",
      "title": "Gold drops 5%, silver slides 8% after rally loses steam",
      "url": "https://www.cryptopolitan.com/gold-and-silver-tumble-as-profit-taking-and-easing-trade-tensions-trigger-sell-offs/",
      "body": "Gold and Silver have garnered a lot of attention in recent weeks as they showed an impressive rally that led the precious metals to break several record highs. However, the upside has run out of steam this week as silver shed around 8% and gold dropped 5%. The two precious metals have been enjoying a rally driven by a combination of factors, including a safe haven demand on the back of escalating geopolitical tensions and fiscal constraints. Gold had reached a new peak beyond $4,390 an ounce, a new record. On the other hand, silver reached a new peak of $54. However, the trade had become quite overcrowded and was running a little hot considering both markets’ levels. Gold’s mix of profit-taking and shifting expectations The sudden correction has wiped over $200 off the price of gold within hours and dragged silver down more than $3. Analysts describe the sell-off as a mix of profit-taking and shifting expectations about the US economic outlook. Gold and Silver are insanely down today. Retail waiting in front of gold stores was indeed a warning signal. Gold alone has almost lost the entire BTC market cap today only. This money will rotate into crypto and shares. Don't be bearish. pic.twitter.com/aiQpSWwo7l — CryptoParsel (@derparsel) October 21, 2025 Traders who had built large positions during gold’s climb appeared to lock in gains ahead of upcoming US inflation data. At the same time, a firmer dollar and modest rebound in bond yields removed some of the urgency to hold non-yielding assets such as bullion. However, the sell-off was not triggered by any single event. Instead, it reflected a confluence of stretched valuations, reduced safe-haven demand, and a temporary pullback in speculative buying that had supported the metals since mid-year. One of the catalysts for the pullback has been the perception of easing tensions between China and the US. As reported by Cryptopolitan, Trump said that he expects to make a trade deal after meeting with President Xi Jinping at a Pacific Rim summit in South Korea later this month. Ten days ago, Trump surprised markets by announcing that he would impose 100% tariffs after China said it would limit its rare earth exports. However, the confirmation of willingness to resolve the issues has been enough to remove some of the risk premia in markets, at least for now. Additionally, market data show that the correction extended beyond spot prices. Shares of gold and silver miners fell sharply, and metals-linked exchange-traded funds recorded heavy outflows. The impact was more pronounced in silver, whose market is smaller and more volatile, leaving it prone to amplified swings when liquidity tightens. Analysts watch historical cycles According to analysts, the only thing that will determine where gold and silver prices are headed is the price history. Past data show that whenever silver prices reached $50, or got close to it, they saw silver trade above $50 for only a short period of time. To that end, two weeks from now, if silver prices are above $50 an ounce, then the marketplace can start to believe both gold and silver are entering new, longer-term price ranges that will continue well above what the price history of the past 50 years has shown. However, suppose silver drops back below $50 in the next couple of weeks. In that case, history will again repeat itself, and that would suggest gold and silver are due for extended downside price corrections and even bear markets farther down the road, to continue the historical cycle of boom and bust seen in all raw commodity markets. Stocks steady as investors gain confidence Stocks are steady, taking comfort from a possible easing of trade tensions between the US and China. Tokyo’s Nikkei rose to a record high in Asia and dented the yen. A broad rally sent all three major US stock indexes to a sharply higher close overnight, with chip stocks hitting a record high. The S&P 500 rose above the flat line. The Dow Jones Industrial Average added 1% as earnings reports from blue-chip companies poured in. The tech-heavy Nasdaq Composite was also roughly flat. In Europe, the STOXX 600 rose 0.1% to trade narrowly below record highs. On the other hand, the crypto market is still a no-go zone. The market is still down 1.22% and the fear and greed index reads a strong fear at 33. However, the king coin seems to be going up by nearly 1% in the last 24 hours. Join a premium crypto trading community free for 30 days - normally $100/mo.",
      "tags": "News|Gold|Silver",
      "lang": "EN",
      "upvotes": "0",
      "downvotes": "0",
      "categories": "ASIA|FIAT|MARKET|TRADING|CRYPTOCURRENCY",
      "source_info": {
        "name": "Cryptopolitan",
        "img": "https://images.cryptocompare.com/news/default/cryptopolitan.png",
        "lang": "EN"
      },
      "source": "cryptopolitan"
    },
    {
      "id": "53461697",
      "guid": "https://ambcrypto.com/?p=539197",
      "published_on": 1761064250,
      "imageurl": "https://images.cryptocompare.com/news/default/ambcrypto.png",
      "title": "Ocean Protocol accused of dumping $100M in $FET tokens",
      "url": "https://ambcrypto.com/ocean-protocol-accused-of-dumping-100m-in-fet-tokens/",
      "body": "Ocean Protocol faces scrutiny after Bubblemaps reported large token transfers to Binance and GSR Markets.",
      "tags": "News|News 1|Social|Trading View",
      "lang": "EN",
      "upvotes": "0",
      "downvotes": "0",
      "categories": "BLOCKCHAIN|EXCHANGE|BNB|FET|CRYPTOCURRENCY",
      "source_info": {
        "name": "AMB Crypto",
        "img": "https://images.cryptocompare.com/news/default/ambcrypto.png",
        "lang": "EN"
      },
      "source": "ambcrypto"
    },
    {
      "id": "53461720",
      "guid": "610656",
      "published_on": 1761064225,
      "imageurl": "https://resources.cryptocompare.com/news/13/53461720.jpeg",
      "title": "Bitcoin On-Chain Alert: BTC MVRV Ratio Breaks Below 365-Day Average – Here’s What This Means",
      "url": "https://bitcoinist.com/bitcoin-mvrv-ratio-breaks-down/",
      "body": "Despite a sudden rebound on Monday, the price of Bitcoin has now fallen below the key $110,000 level after hitting as high as $113,000 last week. As BTC’s price trajectory turns bearish once again, the market seems to be in a highly cautious state, as indicated by a drop below BTC’s MVRV network. Market Sentiment Shifting After A Drop In Bitcoin MVRV? While Bitcoin’s price is showcasing bullish action, key on-chain metrics are currently flashing a potential warning sign in its market dynamics. The most recent warning signal comes from the Bitcoin Market Value to Realized Value (MVRV) ratio. CryptoQuant, a leading on-chain data analytics platform, has shared an update revealing that Bitcoin’s on-chain landscape is flashing caution as the MVRV metric has fallen below its 365-day average. This development hints at a possible shift in market dynamics and sentiment. In the quick-take post, ShayanMarkets highlighted that the key metric is now positioned near the 1.9 level, slightly below its 365-day moving average. This decrease has come before significant turning points, either indicating prime accumulation zones or opening the door for more profound corrections. ShayanMarkets noted that every time the ratio fell below the 365 SMA in the past, it indicated a local bottom indication and a buying opportunity . A similar scenario was observed during the middle of 2021, June 2022, and early 2024. With the scenario reappearing, it simply implies that the market is once again entering an undervaluation phase. The undervaluation phase represents a period where long-term Bitcoin holders usually start to build up their positions. It is important to note that the MVRV Ratio’s position below its long-term average indicates a decline in excessive speculation and an increase in long-term confidence. Such a pattern aligns with the technical reaction from the institutional demand area. Should the metric start to move upward from current levels, it could serve as confirmation that the recent sell-off was a cyclical bottom setup. As a result, the renewed bullish phase into the fourth quarter of this year may receive additional support from the development. BTC’s Dropped Triggers Robust De-Risking After examining several crucial metrics, Glassnode, a financial and data analytics platform, disclosed a highly cautious Bitcoin market landscape. During the decline from $115,000 to $104,000 within 4 days, a sharp de-risking was ignited across the market. Even though BTC later rebounded to $111,000, positioning is still conservative, and market sentiment remained cautious. At the same time, off-chain signals continue to show weakness around the board. Currently, activity in ETFs , futures, options, and spots is all heading downward, and the majority of indicators are at historically low levels. In addition, on-chain activity is exhibiting mixed signals, causing indecision in the market. While there are still large inflows of capital, profitability is being squeezed, and fundamentals are deteriorating. This disparity shows that after last week’s flush, the market is torn between caution and conviction.",
      "tags": "Bitcoin News|bitcoin|Bitcoin Market Value to Realized Value|bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|CryptoQuant|ETFs|Futures|Glassnode|MVRV ratio|Options|ShayanMarkets|Spots",
      "lang": "EN",
      "upvotes": "0",
      "downvotes": "0",
      "categories": "BTC|MARKET|TRADING|CRYPTOCURRENCY",
      "source_info": {
        "name": "Bitcoinist",
        "img": "https://images.cryptocompare.com/news/default/bitcoinist.png",
        "lang": "EN"
      },
      "source": "bitcoinist"
    },
    {
      "id": "53461698",
      "guid": "https://en.coin-turk.com/?p=204901",
      "published_on": 1761064165,
      "imageurl": "https://resources.cryptocompare.com/news/79/53461698.jpeg",
      "title": "Hope Fuels Crypto Surge with Tensions Poised to Ease",
      "url": "https://en.coin-turk.com/hope-fuels-crypto-surge-with-tensions-poised-to-ease/",
      "body": "Hopeful resolutions drive cryptocurrency market growth to unexpected highs. EU proposes 12-point plan to address tensions with Russia. Continue Reading: Hope Fuels Crypto Surge with Tensions Poised to Ease The post Hope Fuels Crypto Surge with Tensions Poised to Ease appeared first on COINTURK NEWS .",
      "tags": "Cryptocurrency News",
      "lang": "EN",
      "upvotes": "0",
      "downvotes": "0",
      "categories": "MARKET|CRYPTOCURRENCY",
      "source_info": {
        "name": "CoinTurk News",
        "img": "https://resources.cryptocompare.com/news/79/default.png",
        "lang": "EN"
      },
      "source": "cointurken"
    },
    {
      "id": "53461633",
      "guid": "https://en.coinotag.com/sign-may-rally-after-25-5m-funding-round-led-by-yzilabs-with-plans-for-identity-infrastructure/",
      "published_on": 1761064148,
      "imageurl": "https://resources.cryptocompare.com/news/77/default.png",
      "title": "SIGN May Rally After $25.5M Funding Round Led by YziLabs, With Plans for Identity Infrastructure",
      "url": "https://en.coinotag.com/sign-may-rally-after-25-5m-funding-round-led-by-yzilabs-with-plans-for-identity-infrastructure/",
      "body": "Sign (SIGN) rose as much as 25% after a $25.5 million strategic funding round led by YziLabs, with IDG Labs participating. The funds will accelerate on-chain identity infrastructure and sovereign",
      "tags": "News",
      "lang": "EN",
      "upvotes": "0",
      "downvotes": "0",
      "categories": "TRADING",
      "source_info": {
        "name": "CoinOtag",
        "img": "https://resources.cryptocompare.com/news/77/default.png",
        "lang": "EN"
      },
      "source": "coinotag"
    },
    {
      "id": "53461600",
      "guid": "https://www.cryptopolitan.com/?p=841598",
      "published_on": 1761063589,
      "imageurl": "https://resources.cryptocompare.com/news/43/53461600.jpeg",
      "title": "Sign surges 25% on $25.5M YziLabs-led round, eyes expansion in digital ID systems",
      "url": "https://www.cryptopolitan.com/sign-recovered-on-news-of-25-5m-by-yzilabs/",
      "body": "Sign (SIGN) recovered from its lows, jumping by as much as 25% within minutes. The main reason was the new funding round for $25.5M, led by YziLabs. Sign (SIGN) turned into one of the day’s active gainers, rising up to 25%. The project got a boost from a new funding round, with $25.5M in new investments. The strategic round was led by YziLabs, considered one of the most successful funds in picking projects at any stage. IDG Labs also participated as one of the backers. SIGN bounced from recent lows, reaching a local peak at $0.055 after the announcement of the new YziLabs-led strategic funding round. | Source: Coingecko SIGN peaked at $0.055, later sinking back to $0.047. The token’s trading volumes also expanded to a one-week high of above $75M in the past 24 hours. SIGN is a relatively new addition to the crypto space, starting its trading journey in May. The token peaked at $0.11 earlier this year, later suffering losses as the altcoin market slowed down. The recent rally got a boost from emerging derivative markets. Open interest for SIGN jumped to a new peak at over $12M. The token is still trading at a small scale and may attempt a shift to a new price level. Sign has an ambitious project of building the infrastructure for personal identity with decentralized credentials. The project allows users to link their current credentials with a blockchain-based identity, drawing traditional internet users to decentralized networks. Sign raises $54.15M, faces dilution risk For Sign, the recent strategic round is the second one led by YziLabs. In early 2026, Binance’s VC fund injected $16M into Sign. So far, the project has raised $54.15M in exchange for token allocations. Currently, SIGN has emerged as a low-float token, valued at just $64M. When SIGN is fully unlocked with its supply of 10B tokens, its valuation may increase. Currently, the fully diluted value is at over $483M, based on current market prices. Only 14.9% of the SIGN tokens are unlocked, potentially creating problems with dilution and future selling. Linear unlocks and the occasional cliff unlock will continue until 2030. SIGN is currently listed on Binance and has significant access to liquidity, but the FDV may still put long-term pressure on the project. Sign prepares to expand its activity in offering identity infrastructure In the earlier stages, Sign focused on token distribution and building its main product for on-chain credentials. The investment will help Sign expand its team and cover a new area – building sovereign infrastructure for governments. Sign will grow with systems for digital identity, currency, and verifiable credentials. BNB Chain will serve as the base layer for all of Sign’s applications, including the sovereign identity ones, to offer scalable national blockchain systems. Sign also announced it is seeking experts in ZK-proofs, cross-chain technology, and Hyperledger Fabric. The project aims to establish multiple teams in several countries. The funding will also go toward building government partnerships and national-scale blockchain-based apps. Sign up to Bybit and start trading with $30,050 in welcome gifts",
      "tags": "News|BNB|SIGN",
      "lang": "EN",
      "upvotes": "0",
      "downvotes": "0",
      "categories": "EXCHANGE|MARKET|TRADING|BNB|CRYPTOCURRENCY",
      "source_info": {
        "name": "Cryptopolitan",
        "img": "https://images.cryptocompare.com/news/default/cryptopolitan.png",
        "lang": "EN"
      },
      "source": "cryptopolitan"
    },
    {
      "id": "53461303",
      "guid": "https://blog.kraken.com/?p=30398",
      "published_on": 1761063489,
      "imageurl": "https://resources.cryptocompare.com/news/98/default.png",
      "title": "BLUAI is available for trading!",
      "url": "https://blog.kraken.com/product/asset-listings/bluai-is-available-for-trading",
      "body": "We’re thrilled to announce that BLUAI is available for trading on Kraken! Funding and trading BLUAI trading is live as of October 21, 2025. To add an asset to your Kraken account, navigate to Funding, select the asset you’re after, and hit ‘Deposit’. Make sure to deposit your tokens into networks supported by Kraken. Deposits made using other networks will be lost. Trade on Kraken Here’s some more information about this asset : Bluwhale AI (BLUAI) Bluwhale AI combines blockchain and AI to give users full control of their data and earn from it securely. Its $BLUAI token powers decentralized AI agents, apps, and data orchestration across chains. Please note: Trading via Kraken App and Instant Buy will be available once the liquidity conditions are met (when a sufficient number of buyers and sellers have entered the market for their orders to be efficiently matched). Geographic restrictions may apply Get Started with Kraken Will Kraken make more assets available? Yes! But our policy is to never reveal any details until shortly before launch – including which assets we are considering. All of Kraken’s available tokens can be found here , and all future tokens will be announced on our Listings Roadmap and social media profiles . Our client engagement specialists cannot answer any questions about which assets we may be making available in the future. The post BLUAI is available for trading! appeared first on Kraken Blog .",
      "tags": "Asset Listings|Kraken|trading",
      "lang": "EN",
      "upvotes": "0",
      "downvotes": "0",
      "categories": "BLOCKCHAIN|EXCHANGE|MARKET|TRADING|CRYPTOCURRENCY",
      "source_info": {
        "name": "Kraken Blog",
        "img": "https://resources.cryptocompare.com/news/98/default.png",
        "lang": "EN"
      },
      "source": "krakenblog"
    },
    {
      "id": "53461254",
      "guid": "https://en.coinotag.com/pharos-network-launches-atlanticocean-testnet-targeting-q1-2026-mainnet/",
      "published_on": 1761063366,
      "imageurl": "https://resources.cryptocompare.com/news/77/53461254.jpeg",
      "title": "Pharos Network Launches AtlanticOcean Testnet, Targeting Q1 2026 Mainnet",
      "url": "https://en.coinotag.com/pharos-network-launches-atlanticocean-testnet-targeting-q1-2026-mainnet/",
      "body": "The Pharos Network AtlanticOcean testnet has launched publicly, serving as the fastest EVM L1 blockchain for testing cross-border tokenized real-world assets (RWAs). It builds on prior achievements with 0.5-second block",
      "tags": "Analysis|News|Core|ETH",
      "lang": "EN",
      "upvotes": "0",
      "downvotes": "0",
      "categories": "BLOCKCHAIN|ETH|MARKET|CRYPTOCURRENCY",
      "source_info": {
        "name": "CoinOtag",
        "img": "https://resources.cryptocompare.com/news/77/default.png",
        "lang": "EN"
      },
      "source": "coinotag"
    },
    {
      "id": "53461252",
      "guid": "https://en.coinotag.com/fed-explores-skinny-accounts-to-potentially-ease-crypto-banking-access-for-bitcoin-firms/",
      "published_on": 1761063354,
      "imageurl": "https://resources.cryptocompare.com/news/77/53461252.jpeg",
      "title": "Fed Explores Skinny Accounts to Potentially Ease Crypto Banking Access for Bitcoin Firms",
      "url": "https://en.coinotag.com/fed-explores-skinny-accounts-to-potentially-ease-crypto-banking-access-for-bitcoin-firms/",
      "body": "The US Federal Reserve is exploring “skinny” master accounts, or payment accounts, to provide fintech and crypto firms with direct access to its payment system, addressing past banking exclusion issues",
      "tags": "News|BTC|Core",
      "lang": "EN",
      "upvotes": "0",
      "downvotes": "0",
      "categories": "BTC|FIAT|MACROECONOMICS|CRYPTOCURRENCY",
      "source_info": {
        "name": "CoinOtag",
        "img": "https://resources.cryptocompare.com/news/77/default.png",
        "lang": "EN"
      },
      "source": "coinotag"
    },
    {
      "id": "53462476",
      "guid": "77c4d5b2-36c0-4527-88ab-fbdb65af2155",
      "published_on": 1761063260,
      "imageurl": "https://resources.cryptocompare.com/news/5/53462476.jpeg",
      "title": "HBAR Slides 4.3% as Institutional Selling Breaks Key Support",
      "url": "https://www.coindesk.com/markets/2025/10/21/hbar-slides-4-3-as-institutional-selling-breaks-key-support",
      "body": "Hedera’s HBAR token tumbled amid heavy early-session sell pressure, breaching critical support before a sharp, high-volume rebound tempered losses in the final hour.",
      "tags": "Markets|AI Market Insights",
      "lang": "EN",
      "upvotes": "0",
      "downvotes": "0",
      "categories": "MARKET|HBAR|CRYPTOCURRENCY",
      "source_info": {
        "name": "CoinDesk",
        "img": "https://resources.cryptocompare.com/news/5/default.png",
        "lang": "EN"
      },
      "source": "coindesk"
    },
    {
      "id": "53461145",
      "guid": "https://en.coinotag.com/fed-considers-active-role-in-crypto-payments-explores-master-account-model-for-stablecoins/",
      "published_on": 1761063183,
      "imageurl": "https://resources.cryptocompare.com/news/77/53461145.jpeg",
      "title": "Fed Considers Active Role in Crypto Payments, Explores Master Account Model for Stablecoins",
      "url": "https://en.coinotag.com/fed-considers-active-role-in-crypto-payments-explores-master-account-model-for-stablecoins/",
      "body": "The Fed is pursuing an active role in shaping a crypto-enabled payments ecosystem, exploring a “payment account” model to connect firms to federal rails while modernizing infrastructure and policy. This",
      "tags": "News|Core|LINK",
      "lang": "EN",
      "upvotes": "0",
      "downvotes": "0",
      "categories": "LINK|CRYPTOCURRENCY",
      "source_info": {
        "name": "CoinOtag",
        "img": "https://resources.cryptocompare.com/news/77/default.png",
        "lang": "EN"
      },
      "source": "coinotag"
    },
    {
      "id": "53461268",
      "guid": "https://cointelegraph.com/news/fed-mulls-payment-accounts-fintechs-small-companies?utm_source=rss_feed&utm_medium=rss%3Fsid%3D80d411aa6623117c%26timestamp%3D1761063347044%26r%3Dx50q7d%26_t%3D1761063347044&utm_campaign=rss_partner_inbound",
      "published_on": 1761063120,
      "imageurl": "https://images.cryptocompare.com/news/default/cointelegraph.png",
      "title": "Fed mulls ‘skinny’ payment accounts to open rails for fintech, crypto firms",
      "url": "https://cointelegraph.com/news/fed-mulls-payment-accounts-fintechs-small-companies?utm_source=rss_feed&utm_medium=rss%3Fsid%3D80d411aa6623117c%26timestamp%3D1761063347044%26r%3Dx50q7d%26_t%3D1761063347044&utm_campaign=rss_partner_inbound",
      "body": "Industry watchers welcomed the idea of “skinny” master accounts as another sign of the end of crypto’s banking troubles, in what insiders describe as “Operation Chokepoint 2.0.”",
      "tags": "",
      "lang": "EN",
      "upvotes": "0",
      "downvotes": "0",
      "categories": "CRYPTOCURRENCY",
      "source_info": {
        "name": "Cointelegraph",
        "img": "https://images.cryptocompare.com/news/default/cointelegraph.png",
        "lang": "EN"
      },
      "source": "cointelegraph"
    },
    {
      "id": "53461078",
      "guid": "https://blog.kraken.com/?p=30412",
      "published_on": 1761063075,
      "imageurl": "https://resources.cryptocompare.com/news/98/default.png",
      "title": "YALA is available for trading!",
      "url": "https://blog.kraken.com/product/asset-listings/yala-is-available-for-trading",
      "body": "We’re thrilled to announce that YALA is available for trading on Kraken! Funding and trading YALA trading is live as of October 21, 2025. To add an asset to your Kraken account, navigate to Funding, select the asset you’re after, and hit ‘Deposit’. Make sure to deposit your tokens into networks supported by Kraken. Deposits made using other networks will be lost. Trade on Kraken Here’s some more information about this asset : Yala (YALA) Yala is a Bitcoin liquidity protocol that channels BTC into ecosystems via YU, a Bitcoin-backed stablecoin pegged to the U.S. dollar. Its design combines risk-mitigation mechanisms and yield optimization to enable secure, composable BTC-backed liquidity flows across networks. Please note: Trading via Kraken App and Instant Buy will be available once the liquidity conditions are met (when a sufficient number of buyers and sellers have entered the market for their orders to be efficiently matched). Geographic restrictions may apply Get Started with Kraken Will Kraken make more assets available? Yes! But our policy is to never reveal any details until shortly before launch – including which assets we are considering. All of Kraken’s available tokens can be found here , and all future tokens will be announced on our Listings Roadmap and social media profiles . Our client engagement specialists cannot answer any questions about which assets we may be making available in the future. The post YALA is available for trading! appeared first on Kraken Blog .",
      "tags": "Asset Listings|Kraken|trading",
      "lang": "EN",
      "upvotes": "0",
      "downvotes": "0",
      "categories": "BLOCKCHAIN|BTC|EXCHANGE|TRADING|CRYPTOCURRENCY",
      "source_info": {
        "name": "Kraken Blog",
        "img": "https://resources.cryptocompare.com/news/98/default.png",
        "lang": "EN"
      },
      "source": "krakenblog"
    },
    {
      "id": "53461102",
      "guid": "https://news.bitcoin.com/?p=764736",
      "published_on": 1761063045,
      "imageurl": "https://resources.cryptocompare.com/news/14/53461102.jpeg",
      "title": "Bitcoin.com Supports the May 2026 Bitcoin Cash Upgrade",
      "url": "https://news.bitcoin.com/bitcoin-com-supports-the-may-2026-bitcoin-cash-upgrade/",
      "body": "Bitcoin Cash continues its mission to deliver fast, affordable, and scalable peer-to-peer payments. With the upcoming May 2026 network upgrade, the blockchain doubles down on usability. Bitcoin Cash Advances On-Chain Innovation With Four New CHIPs in 2026 Network Upgrade At Bitcoin.com, our mission is to make economic freedom accessible to everyone. Bitcoin Cash focuses on",
      "tags": "Blockchain|bitcoin cash BCH|Bitcoin.com",
      "lang": "EN",
      "upvotes": "0",
      "downvotes": "0",
      "categories": "BCH|BLOCKCHAIN|CRYPTOCURRENCY",
      "source_info": {
        "name": "Bitcoin.com",
        "img": "https://images.cryptocompare.com/news/default/bitcoincom.png",
        "lang": "EN"
      },
      "source": "bitcoin.com"
    },
    {
      "id": "53461270",
      "guid": "https://www.cryptopolitan.com/?p=841563",
      "published_on": 1761062951,
      "imageurl": "https://resources.cryptocompare.com/news/43/53461270.jpeg",
      "title": "Fed pressed to modernize systems as crypto and AI collide",
      "url": "https://www.cryptopolitan.com/waller-says-baks-demands-change-for-crypto/",
      "body": "The Fed is openly acknowledging that the future of money will not move without crypto in the room. Speaking Tuesday at the Payments Innovation Conference in Washington, Federal Reserve Governor Christopher Waller said the central bank is preparing to take an active role in what he called a “revolution transforming payments.” Christopher Waller told attendees that the Fed “intends to be an active part of that revolution,” adding that he’s asked staff to explore a “payment account” model — a potential “skinny” master account that would grant firms access to the Fed’s payment rails. According to remarks shared at the event, Waller said the agency must learn how to merge new payment technologies with the traditional banking system. The conference was the first of its kind for the Fed, bringing crypto into its official agenda for the first time. It set a serious tone around how the U.S. financial infrastructure could adapt to stablecoins, AI-based payments, and tokenized systems that are now growing beyond regulatory reach. Fed pressed to modernize systems as crypto and AI collide At 9:50 a.m. ET, a high-profile stablecoin panel began, led by Kyle Samani of Multicoin Capital, alongside Charles Cascarilla from Paxos, Tim Spence of Fifth Third Bank, Fernando Terres from DolarApp, and Heath Tarbert of Circle. Their message was clear: the Fed must upgrade its payment infrastructure and define clearer rules for crypto. Sergey Nazarov, co-founder and CEO of Chainlink, said the Fed’s systems need to become interoperable with stablecoins and tokenized deposits. “The payment landscape represents the buy side of the digital asset economy,” Nazarov said, adding that strong risk frameworks would help the U.S. stay competitive in global payments. Jackie Reses, CEO of Lead Bank, warned that innovation without security could end in disaster. She said AI-driven fraud and deepfake scams could “destabilize trust” if not addressed properly. “It’s always going to be great, until everybody’s grandma is defrauded,” she said, urging the Fed to move cautiously as it integrates AI into financial systems. Michael Shaulov, CEO of Fireblocks, shifted the discussion to economics, warning that stablecoins could reshape credit markets and influence how the Fed conducts monetary policy. Jennifer Barker, global head of treasury services at BNY, followed by outlining what regulators need to prioritize: 24/7 payment rails, technical standards, fraud detection, and a framework for liquidity and redemption in crypto-linked deposits. Bridging banks with crypto’s real infrastructure By 9:30 a.m. ET, before the second session began, Nazarov addressed one of the biggest hurdles: interoperability. He said existing financial networks remain fragmented and outdated, with problems in compliance, identity verification, and accounting systems. Nazarov told Fed officials that a hybrid model (one combining current financial infrastructure with modern regulatory frameworks) could come to life within five years. Reses, who returned to speak again, didn’t mince words about how far behind traditional banks still are. She said most institutions lack the wallet infrastructure and transaction processing systems needed to manage crypto on-ramps and off-ramps. Even though KYC systems have matured for large institutions, she added that retail users remain shut out of easy access to these tools. Reses also predicted that the stablecoin ecosystem will grow naturally through market demand, not by centralized design. Don’t just read crypto news. Understand it. Subscribe to our newsletter. It's free .",
      "tags": "Economy|Federal Reserve",
      "lang": "EN",
      "upvotes": "0",
      "downvotes": "0",
      "categories": "FIAT|MARKET|TRADING|DIGITAL ASSET TREASURY|MACROECONOMICS|CRYPTOCURRENCY",
      "source_info": {
        "name": "Cryptopolitan",
        "img": "https://images.cryptocompare.com/news/default/cryptopolitan.png",
        "lang": "EN"
      },
      "source": "cryptopolitan"
    },
    {
      "id": "53461019",
      "guid": "https://en.coinotag.com/evernorth-plans-nasdaq-listing-as-xrpn-to-advance-institutional-xrp-adoption-with-1b-raise/",
      "published_on": 1761062945,
      "imageurl": "https://resources.cryptocompare.com/news/77/53461019.jpeg",
      "title": "Evernorth Plans Nasdaq Listing as XRPN to Advance Institutional XRP Adoption with $1B Raise",
      "url": "https://en.coinotag.com/evernorth-plans-nasdaq-listing-as-xrpn-to-advance-institutional-xrp-adoption-with-1b-raise/",
      "body": "Evernorth Holdings Inc.’s XRPN Nasdaq listing through a SPAC merger with Armada Acquisition Corp II will raise over $1 billion, backed by Ripple and SBI Holdings, to build a premier",
      "tags": "News|Ripple|XRP",
      "lang": "EN",
      "upvotes": "0",
      "downvotes": "0",
      "categories": "XRP|CRYPTOCURRENCY",
      "source_info": {
        "name": "CoinOtag",
        "img": "https://resources.cryptocompare.com/news/77/default.png",
        "lang": "EN"
      },
      "source": "coinotag"
    },
    {
      "id": "53461028",
      "guid": "https://en.bitcoinsistemi.com/blackrock-attracts-major-bitcoin-btc-whales-to-wall-street-here-are-the-details/",
      "published_on": 1761062889,
      "imageurl": "https://resources.cryptocompare.com/news/81/53461028.jpeg",
      "title": "BlackRock Attracts Major Bitcoin (BTC) Whales to Wall Street! Here Are the Details…",
      "url": "https://en.bitcoinsistemi.com/blackrock-attracts-major-bitcoin-btc-whales-to-wall-street-here-are-the-details/",
      "body": "BlackRock and other asset managers are luring Bitcoin whales to Wall Street, Bloomberg reported. Accordingly, large whales in the US who have been holding large amounts of Bitcoin for a long time have begun converting their spot BTC assets into ETFs. BlackRock is leading the way on this issue, and BlackRock's Head of Digital Assets, Robert Mitchnick, said the company has already facilitated the conversion of over $3 billion worth of Bitcoin into its ETF. This July, a regulatory change allowed large investors to transfer their Bitcoin into an ETF and trade it for shares. At that point, both the IRS and SEC changed rules in July to allow investors to convert their Bitcoin directly into coins and into ETFs without paying taxes. Following this rule change, large Bitcoin holders began shifting their funds to Wall Street ETFs. BlackRock has completed over $3 billion worth of ETF conversions to date, while demand for Bitwise and Galaxy is also increasing. BlackRock's Mitchnick declined to comment on the number of trades whales made under the IBIT ETF, but said greater clarity from regulators would increase volumes and the participation of major banks. Mitchnick added that client demand ranges from investors looking to move just 20% of their Bitcoin into an ETF to those looking to transition entirely to TradFi. *This is not investment advice. Continue Reading: BlackRock Attracts Major Bitcoin (BTC) Whales to Wall Street! Here Are the Details…",
      "tags": "Analysis|Bitcoin|News",
      "lang": "EN",
      "upvotes": "0",
      "downvotes": "0",
      "categories": "BTC|BUSINESS|MARKET|REGULATION|CRYPTOCURRENCY",
      "source_info": {
        "name": "BitcoinSistemi",
        "img": "https://resources.cryptocompare.com/news/81/default.png",
        "lang": "EN"
      },
      "source": "bitcoinsistemi"
    }
  ],
  "fetch_params": {
    "hours_back": 1,
    "timestamp_threshold": 1761062884,
    "time_range_start": "2025-10-21 21:38:04",
    "time_range_end": "2025-10-21 22:38:04"
  }
}